////////////////////////////////////////////////////////////////////////////////
// <Модуль менеджера - Справочник.ум_СпособыОбработкиПакетов.>
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// ТУДУ пример плохой, не будет работать при запуске обработки пакета в сеансе пользователя (вызвать паузу - только ФЗ можно)      

Функция ТекстПримераПроизвольногоКода() Экспорт
	
	Результат = "//
	|// Доступные переменные контекста:
	|//		Данные						 - произвольный	- данные пакета данных.
	|//		ПараметрыПакетаДанных		 - структура	- структура, содержащая информацию о пакете данных.
	|//		ПараметрыСпособаОбработки	 - структура	- структура, содержащая параметры способа обработки на момент вызова процедуры обработки пакета.
	|// 
	|// Возвращаемое значение: необходимо вернуть структуру - ""РезультатОбработкиПакета"" с описанием статуса завершения обработки.
	|// 	СостояниеПакетаДанных:
	|//			Перечисления.ум_СостоянияПакетаДанных.Обработан - пакет успешно обработан
	|//			Перечисления.ум_СостоянияПакетаДанных.Ошибка	- ошибка обработки пакета
	|//			Перечисления.ум_СостоянияПакетаДанных.КОбработке- пакет в данной попытке успешно обработан не был, необходима повторная обработка пакета.
	|// 	Сообщение:
	|//			Произвольнный текст. В случае ошибки сюда необходимо вставить описание ошибки. Значение не обязательное.
	|// 	РезультатОбработки
	|//			Произвольный набор данных. Значение не обязательное.
	|
	|/////////////////////////////////////////////////////
	|// КОД ОБРАБОТКИ ПАКЕТА
	|
	|// Код, который выполняется долго - демонстратор работы пакетов.
	|ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	|ДлинаПаузы = ГСЧ.СлучайноеЧисло(5, 15);
	|ВызватьПаузу(ДлинаПаузы);
	|
	|// КОД ОБРАБОТКИ ПАКЕТА
	|//////////////////////////////////////////////////////
	|
	|РезультатОбработкиПакета = Новый Структура;
	|РезультатОбработкиПакета.Вставить(""СостояниеПакетаДанных""	, Перечисления.ум_СостоянияПакетаДанных.Обработан);
	|РезультатОбработкиПакета.Вставить(""Сообщение""				, ""Вызвали паузу "" + ДлинаПаузы + "" сек."");
	|РезультатОбработкиПакета.Вставить(""РезультатОбработки""		, Неопределено);		// произвольное значение, сохраняемое журнале событий пакетов данных
	|";
	
	Возврат Результат;
	
КонецФункции // ТекстПримераПроизвольногоКода()

Процедура ИнициализацияПредопределенныхЭлементовСпособовОбработкиПакетов() Экспорт
	
	//1. Обслуживание пакетов данных
	СпособОбработки = Справочники.ум_СпособыОбработкиПакетов.ПакетыДанныхОбслуживание;
	ИмяФункции = "ум_ПакетыДанныхОбслуживание.ПакетыДанныхОбслуживание_ОбработкаПакета";
	Параметры  = ПараметрыСпособаОбработкиПакетовПоУмолчанию();
	Параметры.Вставить("ИмяФункции", ИмяФункции);
	ЗаполнитьПараметрыСпособаОбработкиПакетов(СпособОбработки, Параметры);
	
	// 3. Многопоточное изменение пакетов данных
	СпособОбработки = Справочники.ум_СпособыОбработкиПакетов.МногопоточноеИзменениеПакетовДанных;
	ИмяФункции = "ум_ИзменениеПакетовДанных.ОбработчикПакетаДанных_ВыполнитьИзменениеПакетовДанных";
	Параметры  = ПараметрыСпособаОбработкиПакетовПоУмолчанию();
	Параметры.Вставить("ИмяФункции", ИмяФункции);
	ЗаполнитьПараметрыСпособаОбработкиПакетов(СпособОбработки, Параметры);
	
	// 4. Очистка логов ФЗ
	СпособОбработки = Справочники.ум_СпособыОбработкиПакетов.ОчисткаЛоговФЗ;
	ИмяФункции = "ум_ЛогированиеПакетыДанных.СпособОбработкиОчисткаЛоговФЗ";
	Параметры  = ПараметрыСпособаОбработкиПакетовПоУмолчанию();
	Параметры.Вставить("ИмяФункции", ИмяФункции);
	ЗаполнитьПараметрыСпособаОбработкиПакетов(СпособОбработки, Параметры);
	
КонецПроцедуры // ИнициализацияПредопределенныхЭлементовСпособовОбработкиПакетов()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыСпособаОбработкиПакетовПоУмолчанию()
	
	Результат = Новый Структура;
	Результат.Вставить("Активность", Истина);
	Результат.Вставить("КоличествоРабочихФЗ", 5);
	Результат.Вставить("КоличествоПакетовНаРабочееФЗ", 1);
	Результат.Вставить("КоличествоПопытокОбработкиПакета", 10);
	Результат.Вставить("ВремяЖизниУправляющегоФЗ", 60);
	Результат.Вставить("ТаймаутПовторнойОбработкиПакета", 120);
	Результат.Вставить("ПовторнаяОбработкаПакетовСОшибками", Истина);
	Результат.Вставить("УдалятьПакетПриУспешнойОбработке", Истина);
	Результат.Вставить("ТаймаутУдаленияПакета", 24);
	Результат.Вставить("ИспользоватьОбщийСписокОшибок", Истина);
	Результат.Вставить("КоличествоПакетовНаУправляющееФЗ", 0);
		
	Возврат Результат;
	
КонецФункции // ПараметрыСпособаОбработкиПакетовПоУмолчанию()

Процедура ЗаполнитьПараметрыСпособаОбработкиПакетов(СпособОбработки, Параметры)
	
	СпособОбъект = СпособОбработки.ПолучитьОбъект();
	Если СпособОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СпособОбъект.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СпособОбъект, Параметры);
	СпособОбъект.Записать();
	
КонецПроцедуры // ЗаполнитьПараметрыСпособаОбработкиПакетов()

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли
