#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;     
	
	КонтрольЗаполнениеИмениДляРазработчика(Отказ);
		
	Если ИспользоватьПроизвольныйКодОбработки Тогда
		ХешСуммаПроизвольногоКодаОбработки = ум_ПакетыДанныхОбщегоНазначения.ХешФункцияПроизвольногоКода(ПроизвольныйКодОбработки);
	Иначе
		ХешСуммаПроизвольногоКодаОбработки = "";
	КонецЕсли;		
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	// Создание Ключей аналитики пакетов данных
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НужныеКлючи.СостояниеПакета КАК СостояниеПакета,
	|	НужныеКлючи.СпособОбратботки КАК СпособОбратботки,
	|	ум_КлючиАналитикиПакетовДанных.Ссылка Как КлючиАналитики	
	|ИЗ
	|	(ВЫБРАТЬ
	|		ум_СостоянияПакетаДанных.Ссылка КАК СостояниеПакета,
	|		ум_СпособыОбработкиПакетов.Ссылка КАК СпособОбратботки
	|	ИЗ
	|		Справочник.ум_СпособыОбработкиПакетов КАК ум_СпособыОбработкиПакетов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Перечисление.ум_СостоянияПакетаДанных КАК ум_СостоянияПакетаДанных
	|			ПО (ИСТИНА)
	|	ГДЕ
	|		ум_СпособыОбработкиПакетов.Ссылка = &Ссылка) КАК НужныеКлючи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ум_КлючиАналитикиПакетовДанных КАК ум_КлючиАналитикиПакетовДанных
	|		ПО НужныеКлючи.СпособОбратботки = ум_КлючиАналитикиПакетовДанных.СпособОбработкиПакетов
	|			И НужныеКлючи.СостояниеПакета = ум_КлючиАналитикиПакетовДанных.СостояниеПакетаДанных
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	// заблокируем весь справочник ключей, т.к. ожидается что запись новых ключей - редкая операция
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.ум_КлючиАналитикиПакетовДанных");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.КлючиАналитики = Null Тогда
				НовыйКлюч = Справочники.ум_КлючиАналитикиПакетовДанных.СоздатьЭлемент();
				НовыйКлюч.Наименование = СокрЛП(Наименование) + " - " + СокрЛП(Выборка.СостояниеПакета);
				НовыйКлюч.СпособОбработкиПакетов = Ссылка;
				НовыйКлюч.СостояниеПакетаДанных	= Выборка.СостояниеПакета;
				НовыйКлюч.Записать();
			Иначе
				КлючиАналитики = Выборка.КлючиАналитики.Получитьобъект();
				КлючиАналитики.Наименование = СокрЛП(Наименование) + " - " + СокрЛП(Выборка.СостояниеПакета);
				КлючиАналитики.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Предопределенный Тогда
		
		// удалим проверку имени процедуры
		Индекс = ПроверяемыеРеквизиты.Найти("ИмяФункции");
		Если НЕ Индекс = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Индекс);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИмяДляРазработчика = "";
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ум_КлючиАналитикиПакетовДанных.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ум_КлючиАналитикиПакетовДанных КАК ум_КлючиАналитикиПакетовДанных
		|ГДЕ
		|	ум_КлючиАналитикиПакетовДанных.СпособОбработкиПакетов = &СпособОбработкиПакетов";
	
	Запрос.УстановитьПараметр("СпособОбработкиПакетов", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КлючАналитикиОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		КлючАналитикиОбъект.Удалить()
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий()

#Область СлужебныеПроцедурыИФункции

Процедура КонтрольЗаполнениеИмениДляРазработчика(Отказ) 
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;   
	
	Если Не ЗначениеЗаполнено(ИмяДляРазработчика) Тогда
		
		ИмяДляРазработчика = ум_ПакетыДанныхОбщегоНазначения.УникальноеИмяДляРазработчика(Наименование, Ссылка);
		
	ИначеЕсли НЕ ДополнительныеСвойства.Свойство("ПроверкаИмениДляРазработчикаВыполнена") Тогда
		
		ум_ПакетыДанныхОбщегоНазначения.ПроверитьУникальностьИмяДляРазработчика(ИмяДляРазработчика, Ссылка, Отказ);
		
	КонецЕсли; 
	
КонецПроцедуры   

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли