// Функция - Обработчик пакета данных
Функция ОбработчикПакетаДанных(Данные, ПараметрыПакетаДанных, ПараметрыСпособаОбработки) Экспорт

	// Доступные переменные контекста:
	// Данные					- произвольный	- данные пакета данных.
	// ПараметрыПакетаДанных	- структура	- структура, содержащая информацию о пакете данных.
	// ПараметрыСпособаОбработки- структура	- структура, содержащая параметры способа обработки на момент вызова процедуры обработки пакета.
	 
	// Код, который выполняется долго - демонстратор работы пакетов.
	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	ДлинаПаузы = ГСЧ.СлучайноеЧисло(2, 5);
	ДатаОкончания = ТекущаяДатаСеанса() + ДлинаПаузы;

	Индекс = 0;
	Пока ТекущаяДатаСеанса() < ДатаОкончания Цикл	
		Индекс = Индекс + 1;                     
	КонецЦикла;

	ДеталиОбработки = Новый Структура("ДлинаПаузы, Количество", ДлинаПаузы, Индекс);
	Сообщение = СтрШаблон("Совершено %1 итераций.", Индекс);

	// РезультатОбработкиПакета - структура с описанием статуса завершения обработки. Содержит свойства:
	//	СостояниеПакетаДанных:
	//			Перечисления.ум_СостоянияПакетаДанных.Обработан - пакет успешно обработан
	//			Перечисления.ум_СостоянияПакетаДанных.Ошибка	- ошибка обработки пакета
	//			Перечисления.ум_СостоянияПакетаДанных.КОбработке- пакет в данной попытке успешно обработан не был, необходима повторная обработка пакета.
	//	Сообщение			- Строка -	произвольнный текст, сохраняемый в журале событий пакетов данных. Значение не обязательное.
	//	РезультатОбработки	- произвольный - набор данных, сохраняемый в журнале событий пакетов данных. Значение не обязательное. 
	РезультатОбработкиПакета = Новый Структура;
	РезультатОбработкиПакета.Вставить("СостояниеПакетаДанных"	, Перечисления.ум_СостоянияПакетаДанных.Обработан);
	РезультатОбработкиПакета.Вставить("Сообщение"				, Сообщение);
	РезультатОбработкиПакета.Вставить("РезультатОбработки"		, ДеталиОбработки);
	Возврат РезультатОбработкиПакета;
	
КонецФункции
