// Функция - Обработчик пакета данных
//
// Параметры:
//  Данные						 - произвольный	- данные пакета данных.
//  ПараметрыПакетаДанных		 - структура	- структура, содержащая информацию о пакете данных.
//  ПараметрыСпособаОбработки	 - структура	- структура, содержащая параметры способа обработки на момент вызова процедуры обработки пакета.
// 
// Возвращаемое значение:
//   - 
//
Функция ОбработчикПакетаДанных(Данные, ПараметрыПакетаДанных, ПараметрыСпособаОбработки) Экспорт
	
	Перем РезультатОбработки;
		
	////////////////////////////////////////////////////
	// КОД ОБРАБОТКИ ПАКЕТА
	// НАЧАЛО
	// Код, который выполняется долго - демонстратор работы пакетов.
	
	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	ДлинаПаузы = ГСЧ.СлучайноеЧисло(5, 15);
	ДатаОкончания = ТекущаяДатаСеанса() + ДлинаПаузы;
	Индекс = 0;
	Пока ТекущаяДатаСеанса() < ДатаОкончания Цикл
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	РезультатОбработки = Новый Структура("ДлинаПаузы, Количество", ДлинаПаузы, Индекс);
	Сообщение = СтрШаблон("Совершено %1 итераций.", Индекс);
	
	// КОНЕЦ
	// КОД ОБРАБОТКИ ПАКЕТА
	////////////////////////////////////////////////////
	
	РезультатОбработкиПакета = Новый Структура;
	РезультатОбработкиПакета.Вставить("СостояниеПакетаДанных"	, Перечисления.ум_СостоянияПакетаДанных.Обработан);
	РезультатОбработкиПакета.Вставить("Сообщение"				, Сообщение);
	РезультатОбработкиПакета.Вставить("РезультатОбработки"		, РезультатОбработки); // произвольное значение, сохраняемое журале событий пакетов данных
	
	Возврат РезультатОбработкиПакета;
	
КонецФункции
