#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьДанныеПакета(Команда)
	
	Если Элементы.Найти("Список") = Неопределено ИЛИ Элементы.Список.ТекущиеДанные = Неопределено Тогда
		ТекЗапись = Запись;
	Иначе	
		ТекЗапись = Элементы.Список.ТекущиеДанные;
	КонецЕсли;
	
	АдресХранилищаДанных = ПолучитьДанныеПакетаВХранилище(ТекЗапись.ИдентификаторПакета);
	ПараметрыФормы = Новый Структура("АдресХранилищаДанных", АдресХранилищаДанных);
	ТекстЗаголовка = СтрШаблон("Данные результата обработки пакета %1", Строка(ТекЗапись.ИдентификаторПакета));
	ПараметрыФормы.Вставить("Заголовок", ТекстЗаголовка);
	ОткрытьФорму("ОбщаяФорма.ум_ФормаПросмотраДанных",
				 ПараметрыФормы,
				 ЭтаФорма,
				 УникальныйИдентификатор,
				 ,
				 ,
				 ,
				 РежимБлокировкиПриОткрытииОкнаФормы.НеБлокировать
	);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеПакетаВХранилище(ИдентификаторПакета, ИдентификаторФормы = Неопределено) Экспорт
	Данные = ум_ПакетыДанныхОбщегоНазначения.ПолучитьДанныеПакета(ИдентификаторПакета);
	АдресХранилища = ПоместитьВоВременноеХранилище(Данные, ИдентификаторФормы);
	Возврат АдресХранилища;
КонецФункции

#КонецОбласти