#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ИзменитьНастрокиСхемыКомпановкиДанных(СКД, НастройкиОтчета, ОписаниеТипаМетаданных, ФормированиеОтчета) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	| *	
	|ИЗ
	|	ИМЯ_ТАБЛИЦЫ КАК РеквизитыДляПроверки";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИМЯ_ТАБЛИЦЫ", ОписаниеТипаМетаданных);
	
	НаборыДанных = СКД.НаборыДанных.НаборДанных1;
	
	НаборыДанных.Запрос = ТекстЗапроса;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий()

#Область СлужебныеПроцедурыИФункции

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли
