
////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КоличествоОбъектовНаОдинПакет = 10;
	
	СхемаКомпоновкиДанных = Обработки.ум_СозданиеПакетовДанных.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КоличествоВыборки = Новый ФорматированнаяСтрока("Размер выборки");
	Элементы.РазмерВыборки.ЦветТекста = Новый Цвет;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостью();
	ОбновитьЗаголовокКнопкиВыбратьПервые();
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий элементов формы
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидИзмененияПриИзменении(Элемент)
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипИзменяемыхДанныхВыборЗначения(Результат, ДопПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ТипДанныхВыборки = Результат.ПолноеИмя;
		ПриИзмененииТипаМетаданныхНаСервере();
		УправлениеВидимостью();
		КоличествоВыборки = "Размер выборки";
		Элементы.РазмерВыборки.ЦветТекста = Новый Цвет;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипИзменяемхДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ТипИзменяемыхДанныхВыборЗначения",ЭтаФорма,ТипДанныхВыборки);
	ОткрытьФорму("Обработка.ум_СозданиеПакетовДанных.Форма.ФормаВыбораТипаОбъекта",
				,
				ЭтаФорма,
				,
				ВариантОткрытияОкна.ОтдельноеОкно,
				,
				Оповещение,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура РазмерВыборкиПриИзменении(Элемент)
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	Значение = ПолучитЗначениеРасшифровки(Расшифровка);
	ТипЗначения = ТипЗнч(Значение);
	НадоПоказатьЗначение = Не ТипЗначения = Тип("Булево") И Не ТипЗначения = Тип("Строка") И Не ТипЗначения = Тип("Число") И
	Не ТипЗначения = Тип("Дата") И Не ТипЗначения = Тип("ДвоичныеДанные");
	Если НадоПоказатьЗначение Тогда
		ПоказатьЗначение(, Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипИзменяемхДанныхОчистка(Элемент, СтандартнаяОбработка)
	ТипДанныхВыборки = "";
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПервыхПриИзменении(Элемент)
	ОбновитьЗаголовокКнопкиВыбратьПервые();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроизвестиДействиеНадОбъектами(Команда)
	
	Отказ = Ложь;
	ВыполнитьПроверку(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СпособОбработкиПакетов) Тогда
		// Способа обработки не надо даже заходить в выбор
		ум_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		"Поле ""Способ обработки пакетов"" не заполнено.",
		,
		"СпособОбработкиПакетов");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КоличествоОбъектовНаОдинПакет) Тогда
		ум_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		"Поле ""Количество объектов на один пакет"" не заполнено.",
		,
		"КоличествоОбъектовНаОдинПакет");
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормыСозданияПакетовДанных", ЭтотОбъект, Неопределено);
	
	РазмерВыборки = 0;
	ИдентификаторЗадания = СформироватьФоновоеЗаданиеНаФормированиеПакетов();
	
	ТекстСообщения = "Выполняется выборка данных." + Символы.ПС + "Пожалуйста, подождите...";
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторЗадания", ИдентификаторЗадания);
	ПараметрыФормы.Вставить("ТекстСообщения", ТекстСообщения);
	//ПараметрыФормы.Вставить("АвтоЗакрытие", Истина);
	
	ОткрытьФорму("ОбщаяФорма.ум_ФормаПрогрессБар",
				 ПараметрыФормы,
				 ЭтаФорма,
				 УникальныйИдентификатор,
				 ,
				 ,
				 Оповещение,
				 РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца
	);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсе(Команда)
	
	Отказ = Ложь;
	ВыполнитьПроверку(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПервые10(Команда)
	
	Отказ = Ложь;
	ВыполнитьПроверку(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(КоличествоПервых) И КоличествоПервых < 10 Тогда
		РазмерВыборки = КоличествоПервых;
	Иначе
		РазмерВыборки = 10;
	КонецЕсли;
	ПоказатьНаСервере(РазмерВыборки);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоказатьНаСервере(РазмерВыборки = 0)
	
	Если РазмерВыборки = 0 Тогда
		ОбновитьРазмерВыборкиНаСервере();
	КонецЕсли;
	
	СформироватьРезультатВТабличныйДокумент(РазмерВыборки);
	
КонецПроцедуры

&НаСервере
Функция СформироватьФоновоеЗаданиеНаФормированиеПакетов()
	Перем ДанныеРасшифровки;
	
	СхемаКомпоновкиДанных = Обработки.ум_СозданиеПакетовДанных.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	НастройкиСКД = КомпоновщикНастроек.Настройки;
	Обработки.ум_СозданиеПакетовДанных.ИзменитьНастрокиСхемыКомпановкиДанных(СхемаКомпоновкиДанных, НастройкиСКД, ТипДанныхВыборки, Истина);
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
													НастройкиСКД,
													ДанныеРасшифровки,
													,
													Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")
	);
	
	ИсходныйТекстЗапроса = МакетКомпоновки.НаборыДанных.НаборДанных1.Запрос;
	Если КоличествоПервых = 0 Тогда
		ТекстЗапроса = ИсходныйТекстЗапроса;
	Иначе
		ТекстЗапроса = СтрЗаменить(ИсходныйТекстЗапроса, "ВЫБРАТЬ", "ВЫБРАТЬ ПЕРВЫЕ "+Формат(КоличествоПервых,"ЧГ="));
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура;
	Для каждого ЗначениеПараметра Из МакетКомпоновки.ЗначенияПараметров Цикл
		ПараметрыЗапроса.Вставить(ЗначениеПараметра.Имя, ЗначениеПараметра.Значение);
	КонецЦикла;
	
	ИмяПроцедуры = "ум_СозданиеПакетовДанных.СоздатьПакетыДанных";
	ПараметрыПроцедуры = Новый Массив;
	ПараметрыПроцедуры.Добавить(ТекстЗапроса);
	ПараметрыПроцедуры.Добавить(ПараметрыЗапроса);
	ПараметрыПроцедуры.Добавить(СпособОбработкиПакетов);
	ПараметрыПроцедуры.Добавить(КоличествоОбъектовНаОдинПакет);
	ПараметрыПроцедуры.Добавить(ТипДанныхВыборки);
	
	Задание = ФоновыеЗадания.Выполнить(ИмяПроцедуры, ПараметрыПроцедуры, , "ум_СозданиеПакетовДанных");
	ИдентификаторЗадания = Задание.УникальныйИдентификатор;
	
	Возврат ИдентификаторЗадания;
	
КонецФункции

&НаСервере
Процедура СформироватьРезультатВТабличныйДокумент(Знач РазмерВыборки)
	ДанныеРасшифровкиКД = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	СхемаКомпоновкиДанных = Обработки.ум_СозданиеПакетовДанных.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	НастройкиСКД = КомпоновщикНастроек.Настройки;
	Обработки.ум_СозданиеПакетовДанных.ИзменитьНастрокиСхемыКомпановкиДанных(СхемаКомпоновкиДанных, НастройкиСКД, ТипДанныхВыборки, Истина);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиСКД, ДанныеРасшифровкиКД);
	
	ИсходныйТекстЗапроса = МакетКомпоновки.НаборыДанных.НаборДанных1.Запрос;
	Если РазмерВыборки = 0 Тогда
		МакетКомпоновки.НаборыДанных.НаборДанных1.Запрос = ИсходныйТекстЗапроса;
	Иначе
		МакетКомпоновки.НаборыДанных.НаборДанных1.Запрос = СтрЗаменить(ИсходныйТекстЗапроса, "ВЫБРАТЬ", "ВЫБРАТЬ ПЕРВЫЕ "+Формат(РазмерВыборки,"ЧГ="));
	КонецЕсли;
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровкиКД);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	Результат.Очистить();
	ПроцессорВывода.УстановитьДокумент(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиКД, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииТипаМетаданныхНаСервере()
	
	Результат.Очистить();
	
	Если Не ЗначениеЗаполнено(ТипДанныхВыборки) Тогда
		Возврат;
	КонецЕсли;
	
	// очистим выбранные поля - их точно нужно сбрасывать, а вот отборы и структуру оставим.
	КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
	КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
	
	// получим скд из макета
	СКД = Обработки.ум_СозданиеПакетовДанных.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	НастройкиСКД = КомпоновщикНастроек.Настройки;
	
	ДобавитьПоляПоУмолчанию();
	
	// Изменим полученную СКД - установим текст запроса исходя из выбранного типа метаданных
	Обработки.ум_СозданиеПакетовДанных.ИзменитьНастрокиСхемыКомпановкиДанных(СКД, НастройкиСКД, ТипДанныхВыборки, Ложь);
	
	// инициализируем форму по изменненой схеме
	АдресСхемы = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.Настройки);
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()
	ТипДанныхВыборкиВыбран = ЗначениеЗаполнено(ТипДанныхВыборки);
	Элементы.КомпоновщикНастроекНастройкиОтбор.Доступность = ТипДанныхВыборкиВыбран;
	Элементы.КомпоновщикНастроекНастройкиПараметрыВывода.Доступность = ТипДанныхВыборкиВыбран;
	Элементы.ГруппаПоказать.Доступность = ТипДанныхВыборкиВыбран;
	Элементы.СоздатьПакетыНаИзмениениеДанных.Доступность = ТипДанныхВыборкиВыбран;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыСозданияПакетовДанных(Результат, ДопПараметры) Экспорт
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверку(Отказ)
	ОчиститьСообщения();
	
	ПроверитьЭлементыОтборов(КомпоновщикНастроек.Настройки.Отбор.Элементы, Отказ);
	
	КоличествоПолей = 0;
	Для каждого текЭлемент Из КомпоновщикНастроек.Настройки.Выбор.Элементы Цикл
		Если текЭлемент.Использование Тогда
			КоличествоПолей = КоличествоПолей + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если Не КоличествоПолей Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо выбрать хотя бы одно поле вывода.";
		Сообщение.ПутьКДанным = "КомпоновщикНастроек.Настройки.Выбор";
		// Сообщение.Поле  = 
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЭлементыОтборов(Элементы, Отказ, НомерСтроки = 0)
	Для Каждого текЭлемент Из Элементы Цикл
		НомерСтроки = НомерСтроки + 1;
		Если ТипЗнч(текЭлемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			ПроверитьЭлементыОтборов(текЭлемент.Элементы, Отказ, НомерСтроки);
		ИначеЕсли ТипЗнч(текЭлемент) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если Не ЗначениеЗаполнено(текЭлемент.ЛевоеЗначение) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("В строке %1 отборов не заполнено поле", НомерСтроки);
				Сообщение.ПутьКДанным = "КомпоновщикНастроек.Настройки.Отбор";
				//Сообщение.Поле = СтрШаблон("Элементы[%1].ЛевоеЗначение", НомерСтроки - 1);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитЗначениеРасшифровки(Расшифровка)
	Перем Результат;
	ДанныеРасшифровкиКД = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	ЭлементРашифровки = ДанныеРасшифровкиКД.Элементы[Расшифровка];
	Если ТипЗнч(ЭлементРашифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
		ЗначенияПолей = ЭлементРашифровки.ПолучитьПоля();
		Для Каждого ЗначениеПоля Из ЗначенияПолей Цикл
			Результат = ЗначениеПоля.Значение;
			Прервать;
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ДобавитьПоляПоУмолчанию()
	Если Лев(СокрЛП(ТипДанныхВыборки), 7) = "Регистр" Тогда
		МД = Метаданные.НайтиПоПолномуИмени(ТипДанныхВыборки);
		Для каждого текИзмерени Из МД.СтандартныеРеквизиты Цикл
			текПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			текПоле.Поле = Новый ПолеКомпоновкиДанных(текИзмерени.Имя);
			текПоле.Использование = Истина;
		КонецЦикла;
		Для каждого текИзмерени Из МД.Измерения Цикл
			текПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			текПоле.Поле = Новый ПолеКомпоновкиДанных(текИзмерени.Имя);
			текПоле.Использование = Истина;
		КонецЦикла;
	Иначе
		// добовляем Ссылку по умолчянию
		ПолеСсылка = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеСсылка.Поле = Новый ПолеКомпоновкиДанных("Ссылка");
		ПолеСсылка.Использование = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокКнопкиВыбратьПервые()
	Если ЗначениеЗаполнено(КоличествоПервых) И КоличествоПервых < 10 Тогда
		РазмерВыборки = КоличествоПервых;
	Иначе
		РазмерВыборки = 10;
	КонецЕсли;
	Элементы.ПоказатьПервые10.Заголовок = "Показать первые " + РазмерВыборки;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРазмерВыборки(Команда)
	ОбновитьРазмерВыборкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТипИзменяемхДанныхПриИзменении(Элемент)
	КоличествоВыборки = "Размер выборки";
	Элементы.РазмерВыборки.ЦветТекста = Новый Цвет;
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриИзменении(Элемент)
	КоличествоВыборки = "Размер выборки";
	Элементы.РазмерВыборки.ЦветТекста = Новый Цвет;
КонецПроцедуры

&НаСервере
Процедура ОбновитьРазмерВыборкиНаСервере()
	Перем ДанныеРасшифровки;
	
	СхемаКомпоновкиДанных = Обработки.ум_СозданиеПакетовДанных.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	НастройкиСКД = КомпоновщикНастроек.Настройки;
	Обработки.ум_СозданиеПакетовДанных.ИзменитьНастрокиСхемыКомпановкиДанных(СхемаКомпоновкиДанных, НастройкиСКД, ТипДанныхВыборки, Истина);
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
													НастройкиСКД,
													ДанныеРасшифровки,
													,
													Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")
	);
	
	КоличествоВыборки = Строка(КоличествоОбъектов(ТипДанныхВыборки, МакетКомпоновки)) + " шт.";
	Элементы.РазмерВыборки.ЦветТекста = Новый Цвет(0, 0, 255);

КонецПроцедуры

&НаСервереБезКонтекста
Функция КоличествоОбъектов(ТипДанныхВыборки, МакетКомпоновки)

	
	ТекстЗапроса = МакетКомпоновки.НаборыДанных.НаборДанных1.Запрос;
	Позиция = СтрНайти(ТекстЗапроса, " КАК РеквизитыДляПроверки");
	
	Запрос = Новый Запрос;
	Для каждого ЗначениеПараметра Из МакетКомпоновки.ЗначенияПараметров Цикл
		Запрос.УстановитьПараметр(ЗначениеПараметра.Имя, ЗначениеПараметра.Значение);


	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	" + ТипДанныхВыборки + 
	Прав(ТекстЗапроса, СтрДлина(ТекстЗапроса) - Позиция + 1);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Количество;
	
КонецФункции

#КонецОбласти

