#Область ПрограммныйИнтерфейс

Процедура СоздатьПакетыДанных(ТекстЗапроса, ПараметрыЗапроса, СпособОбработкиПакетов, КоличествоОбъектовНаОдинПакет, ТипДанныхВыборки) Экспорт
	Перем ДатаСледующейОбработкиПакета;
	
	Сообщение = Новый СообщениеПользователю;
	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("ТекстСообщения", "Выполняется выборка данных." + Символы.ПС + "Пожалуйста, подождите...");
	ТекстСообщения = ЗначениеВСтрокуВнутр(СтруктураСообщения);
	Сообщение.Сообщить();
	
	Запрос = Новый Запрос;
	Для каждого текПараметр Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(текПараметр.Ключ, текПараметр.Значение);
	КонецЦикла;
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Таблица = СоздатьТаблицуЗначений(РезультатЗапроса);
	
	Выборка = РезультатЗапроса.Выбрать();
	КоличествоВсего = Выборка.Количество();
	
	Количество = 0;
	КоличествоПакетов = 0;
	ПроцентВСообщении = 0;
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Количество = Количество + 1;
		
		Если Таблица.Количество() = КоличествоОбъектовНаОдинПакет Тогда
			
			Комментарий = "" + Таблица.Количество() + " объектов.";
			ум_ПакетыДанных.СоздатьПакетДанных(	Таблица,
												СпособОбработкиПакетов,
												ДатаСледующейОбработкиПакета,
												ТипДанныхВыборки,
												Комментарий
			);
			Таблица.Очистить();
			КоличествоПакетов = КоличествоПакетов + 1;
			
			//Надо отправлять когда поменялся процент
			Процент = Окр(Количество / КоличествоВсего * 100);
			Если Не ПроцентВСообщении = Процент Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СформироватьСообщениеОСозданииПакетов(Процент,
																		Количество,
																		КоличествоВсего,
																		КоличествоПакетов
				);
				Сообщение.Сообщить();
				ПроцентВСообщении = Процент;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Таблица.Количество() Тогда
		Комментарий = "" + Таблица.Количество() + " объектов.";
		ум_ПакетыДанных.СоздатьПакетДанных(	Таблица,
											СпособОбработкиПакетов,
											ДатаСледующейОбработкиПакета,
											ТипДанныхВыборки,
											Комментарий
		);
		КоличествоПакетов = КоличествоПакетов + 1;
	КонецЕсли;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СформироватьСообщениеОСозданииПакетов(100,
															Количество,
															КоличествоВсего,
															КоличествоПакетов
	);
	Сообщение.Сообщить();
	
КонецПроцедуры

Функция СформироватьСообщениеОСозданииПакетов(Процент, Количество, КоличествоВсего, КоличествоПакетов)
	
	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("ТекстСообщения", "Выполняется создание пакетов данных." + Символы.ПС + "Пожалуйста, подождите...");
	СтруктураСообщения.Вставить("Прогресс", Процент);
	ТекстШаблона = "Обработано %1 из %2 записей" + Символы.ПС +"Cоздано пакетов %3";
	ТекстОписания = СтрШаблон(ТекстШаблона, Количество, КоличествоВсего, КоличествоПакетов);
	СтруктураСообщения.Вставить("ТекстОписания", ТекстОписания);
	Результат = ЗначениеВСтрокуВнутр(СтруктураСообщения);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция СоздатьТаблицуЗначений(РезультатЗапроса)
	
	Результат = Новый ТаблицаЗначений;
	Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
		Результат.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
