#Область ПрограммныйИнтерфейс

// Функция - Функция УСТАРЕЛА. Создание нового пакета данных.
//
// Параметры:
//  Данные						 - число - Произвольные данные
//  СпособОбработки				 - Наименование элемента справочника ум_СпособыОбработкиПакетов или ссылка на элемент этого справочника
//  КодИС						 - Строка - Код информационной системы-источника пакета
//  ДополнительнаяИнформация	 - Строка - Дополнительная информация о пакете данных
//  Комментарий					 - Строка - Произвольный комментарий к пакету данных
//  ДатаСледующейОбработкиПакета - Дата - Дата, после которой система будет пытаться обработать пакет данных
// 
// Возвращаемое значение:
//  Структура, содержащая поля: ИдентификаторПакета, ДатаСозданияПакета, ОшибкаЗаписиПакета, ОписаниеОшибки 
Функция СоздатьНовыйПакетДанных(Данные, СпособОбработки, КодИС = "ТекБД", ДополнительнаяИнформация = "", Комментарий = "", ДатаСледующейОбработкиПакета = Неопределено) Экспорт
		
	Если КодИС = "ТекБД" Тогда
		Результат  = ум_ПакетыДанных.СоздатьПакетДанных(Данные, СпособОбработки, ДатаСледующейОбработкиПакета, ДополнительнаяИнформация, Комментарий);
	Иначе
		// Для совместимости. Если КодИС заполнен - сохраним в комментарии
		Результат  = ум_ПакетыДанных.СоздатьПакетДанных(Данные, СпособОбработки, ДатаСледующейОбработкиПакета, ДополнительнаяИнформация, КодИС +" " + Комментарий);
	КонецЕсли;
	
	РезультатСтарый = Новый Структура("ИдентификаторПакета, ДатаСозданияПакета, ОшибкаЗаписиПакета, ОписаниеОшибки");        
	
	Результат.Свойство("ИдентификаторПакета", РезультатСтарый.ИдентификаторПакета);
	РезультатСтарый.ДатаСозданияПакета = ТекущаяДатаСеанса();
	Результат.Свойство("Ошибка"				, РезультатСтарый.ОшибкаЗаписиПакета);
	Результат.Свойство("ОписаниеОшибки"		, РезультатСтарый.ОписаниеОшибки);	
	
	Возврат РезультатСтарый;
	
КонецФункции

#КонецОбласти
