  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	                          
	ОтборПоСпособу = Неопределено;                         
	Параметры.Свойство("СпособОбработкиПакета", ОтборПоСпособу);      
	
	// выберем пакеты в ошибках, сгруппируем их по тексту ошибки
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ум_ПакетыДанных.ИдентификаторПакета КАК ИдентификаторПакета
	|ПОМЕСТИТЬ ВТ_ИДентификаторыПакетовСОшибокой
	|ИЗ
	|	РегистрСведений.ум_ПакетыДанных КАК ум_ПакетыДанных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ум_КлючиАналитикиПакетовДанных.Ссылка КАК Ссылка
	|		ИЗ
	|			Справочник.ум_КлючиАналитикиПакетовДанных КАК ум_КлючиАналитикиПакетовДанных
	|		ГДЕ
	|			ум_КлючиАналитикиПакетовДанных.СостояниеПакетаДанных = &СостояниеОшибка
	|			И ВЫБОР
	|					КОГДА &Способ = НЕОПРЕДЕЛЕНО
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ум_КлючиАналитикиПакетовДанных.СпособОбработкиПакетов = &Способ
	|				КОНЕЦ) КАК ВложенныйЗапрос
	|		ПО ум_ПакетыДанных.КлючАналитикиПакетаДанных = ВложенныйЗапрос.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ум_ЖурналСобытийПакетовДанных.ИдентификаторПакета КАК ИдентификаторПакета,
	|	ВЫРАЗИТЬ(ум_ЖурналСобытийПакетовДанных.Сообщение КАК СТРОКА(1000)) КАК Сообщение,
	|	ум_ЖурналСобытийПакетовДанных.КлючАналитикиПакетаДанных.СостояниеПакетаДанных КАК СостояниеПакетаДанных,
	|	ум_ЖурналСобытийПакетовДанных.КлючАналитикиПакетаДанных.СпособОбработкиПакетов КАК СпособОбработки,
	|	ум_ЖурналСобытийПакетовДанных.ДатаСобытия КАК ДатаСобытия
	|ИЗ
	|	ВТ_ИДентификаторыПакетовСОшибокой КАК ВТ_ИДентификаторыПакетовСОшибокой
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ум_ЖурналСобытийПакетовДанных КАК ум_ЖурналСобытийПакетовДанных
	|		ПО ВТ_ИДентификаторыПакетовСОшибокой.ИдентификаторПакета = ум_ЖурналСобытийПакетовДанных.ИдентификаторПакета
	|ГДЕ
	|	ум_ЖурналСобытийПакетовДанных.КлючАналитикиПакетаДанных.СостояниеПакетаДанных = &СостояниеОшибка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сообщение
	|ИТОГИ
	|	МАКСИМУМ(ДатаСобытия)
	|ПО
	|	ИдентификаторПакета";

	Запрос.УстановитьПараметр("Способ"			, ОтборПоСпособу);
	Запрос.УстановитьПараметр("СостояниеОшибка"	, Перечисления.ум_СостоянияПакетаДанных.Ошибка);

	РезультатЗапроса = Запрос.Выполнить();
	
	СоответствиеОшибокИдентификаторов = Новый Соответствие;  
	
	ВыборкаПакеты = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока ВыборкаПакеты.Следующий() Цикл
		
		ВыборкаОшибкиПакета = ВыборкаПакеты.Выбрать();
		
		Пока ВыборкаОшибкиПакета.Следующий() Цикл
			
			Если ВыборкаПакеты.ДатаСобытия <> ВыборкаОшибкиПакета.ДатаСобытия Тогда // это последняя ошибка пакета?
				Продолжить;		
			КонецЕсли;	
				
			ЗначениеСоответствия = СоответствиеОшибокИдентификаторов.Получить(ВыборкаОшибкиПакета.Сообщение);
			Если ЗначениеСоответствия = Неопределено Тогда
				СоответствиеОшибокИдентификаторов.Вставить(ВыборкаОшибкиПакета.Сообщение, Новый СписокЗначений);	
				ЗначениеСоответствия = СоответствиеОшибокИдентификаторов.Получить(ВыборкаОшибкиПакета.Сообщение);	
			КонецЕсли;
				
			ЗначениеСоответствия.Добавить(ВыборкаОшибкиПакета.ИдентификаторПакета); 
			
			Прервать;
			
		КонецЦикла;
	КонецЦикла;
	
	Для каждого Эл Из СоответствиеОшибокИдентификаторов Цикл
		
		НоваяСтрока = ТаблицаОшибок.Добавить();
		НоваяСтрока.ОшибкаНаименование = Эл.Ключ;
		НоваяСтрока.КоличествоПакетов = Эл.Значение.Количество();	
		НоваяСтрока.СписокОбъектов = Эл.Значение; 

	КонецЦикла;
	
	ТаблицаОшибок.Сортировать("ОшибкаНаименование Убыв"); 
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
			
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если ум_ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, "8.5.1.0") > 0 Тогда
		МассивВыделенныхСтрок = Элементы.ТаблицаОшибок.ПолучитьСтрокиДляОбработки();
	Иначе     
		МассивВыделенныхСтрок = Элементы.ТаблицаОшибок.ВыделенныеСтроки; 
	КонецЕсли;       
	
	СписокОбъектов = Новый СписокЗначений;  	
	Для Каждого НомерЭлемент ИЗ МассивВыделенныхСтрок Цикл  	
		СписокИзВыбранного = ТаблицаОшибок.Получить(НомерЭлемент).СписокОбъектов; 	
		Для Каждого ЗначениеИзВыбранного Из СписокИзВыбранного Цикл
			СписокОбъектов.Добавить(ЗначениеИзВыбранного.Значение);	
		КонецЦикла;  		
	КонецЦикла;     
	
	Закрыть(СписокОбъектов);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СписокОбъектов = ТаблицаОшибок.Получить(ВыбраннаяСтрока).СписокОбъектов;  	
	Закрыть(СписокОбъектов);
	
КонецПроцедуры
