// ТУДУ - в этом модуле есть функции наши и функции, которые мы взяли из БСП.
// Те функции, которые мы взяли из БСП нужно перенести в модуль ум_БСП_ОбщегоНазначенияКлиентСервер или иной, названный по этому шаблону. Наши функции должны остаться в этом модуле.
// ВАЖНО! Часть функций БСП взято из устарешвей версии - нужно обновить.


// аналоги типовых функций, которые не доступны в режиме совместимости
Функция СтрРазделить82(Строка, Разделитель, ВключатьПустые = Истина) Экспорт
    МассивЗначений = Новый Массив();
    Символ = Найти(Строка, Разделитель);
    Пока Символ > 0 Цикл
        Если ВключатьПустые или (СтрДлина(Лев(Строка, Символ - 1)) > 0) Тогда
            МассивЗначений.Добавить(Лев(Строка, Символ - 1));
        КонецЕсли;
        Строка = Прав(Строка, СтрДлина(Строка) - Символ);
        Символ = Найти(Строка, Разделитель);
    КонецЦикла;
    Если (ВключатьПустые или СтрДлина(Строка) > 0) Тогда
        МассивЗначений.Добавить(Строка);
    КонецЕсли;
    Возврат МассивЗначений;
КонецФункции

// аналоги типовых функций, которые не доступны в режиме совместимости
Функция СтрНайти82(Знач Строка,Знач ПодстрокаПоиска,Знач НаправлениеПоискаСКонца = Ложь, Знач НачальнаяПозиция = Неопределено,Знач НомерВхождения = 1) Экспорт
    
    ТекущаяПозиция = 0;
    ЗнакНаправленияДвижения = 0; 
    ДлинаСтрПоиска = СтрДлина(ПодстрокаПоиска);

    Попытка
        Если НЕ НачальнаяПозиция = Неопределено Тогда
            НачальнаяПозиция = Число(НачальнаяПозиция);    
            Если НачальнаяПозиция <= 0 ИЛИ НачальнаяПозиция > СтрДлина(Строка) Тогда
                ВызватьИсключение ("");                    
            КонецЕсли;            
        КонецЕсли;        
    Исключение        
        ВызватьИсключение("Недопустимое значение параметра (параметр номер '4')");
    КонецПопытки;
        
    Если НаправлениеПоискаСКонца Тогда 
        НачальнаяПозиция = ?(НЕ НачальнаяПозиция = Неопределено, НачальнаяПозиция,СтрДлина(Строка));
        ЗнакНаправленияДвижения = -1;
    Иначе    
        НачальнаяПозиция = ?(НЕ НачальнаяПозиция = Неопределено, НачальнаяПозиция,1);
        ЗнакНаправленияДвижения = 1;
    КонецЕсли;
            
    Пока Истина
        И НЕ НомерВхождения = 0
        И ((НЕ НаправлениеПоискаСКонца И НачальнаяПозиция <= СтрДлина(Строка)) 
          ИЛИ (НаправлениеПоискаСКонца И НачальнаяПозиция >= 0)) Цикл    
          
        Позиция = Найти(Сред(Строка,НачальнаяПозиция, ДлинаСтрПоиска),ПодстрокаПоиска); 
        
        Если Позиция Тогда 
            ТекущаяПозиция = НачальнаяПозиция;
            НачальнаяПозиция = ТекущаяПозиция + ДлинаСтрПоиска * ЗнакНаправленияДвижения;
            НомерВхождения = НомерВхождения - 1;
        Иначе
            НачальнаяПозиция = НачальнаяПозиция + 1 * ЗнакНаправленияДвижения; 
        КонецЕсли;
        
    КонецЦикла;
    
    Если НомерВхождения Тогда
        ТекущаяПозиция  = 0;
    КонецЕсли;
    
    Возврат ТекущаяПозиция;
    
КонецФункции 

Процедура СообщитьПользователю(
		Знач ТекстСообщенияПользователю,
		Знач КлючДанных = Неопределено,
		Знач Поле = "",
		Знач ПутьКДанным = "",
		Отказ = Ложь) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Поле = Поле;
	
	ЭтоОбъект = Ложь;
	
#Если НЕ ТонкийКлиент И НЕ ВебКлиент Тогда
	Если КлючДанных <> Неопределено
	   И XMLТипЗнч(КлючДанных) <> Неопределено Тогда
		ТипЗначенияСтрокой = XMLТипЗнч(КлючДанных).ИмяТипа;
		ЭтоОбъект = СтрНайти82(ТипЗначенияСтрокой, "Object.") > 0;
	КонецЕсли;
#КонецЕсли
	
	Если ЭтоОбъект Тогда
		Сообщение.УстановитьДанные(КлючДанных);
	Иначе
		Сообщение.КлючДанных = КлючДанных;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
		
	Сообщение.Сообщить();
	
	Отказ = Истина;
	
КонецПроцедуры

&НаСервере
Функция ТаблицаВМассивСтруктур(Знач ТаблицаЗначений) Экспорт
	Результат = Новый Массив;
	
	ИменаКолонок = "";
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		ИменаКолонок = ИменаКолонок + "," + Колонка.Имя;
	КонецЦикла;
	ИменаКолонок = Сред(ИменаКолонок, 2);
	
	Для Каждого Строка Из ТаблицаЗначений Цикл
		СтруктураСтроки = Новый Структура(ИменаКолонок);
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, Строка);
		Результат.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция РазбитьТаблицу(ИсходнаяТаблица, СтрокНаТаблицу) Экспорт
	
	МассивТаблиц = Новый Массив;  	
	СтрокВсего = ИсходнаяТаблица.Количество();
	
	Если СтрокВсего = 0 Тогда
		МассивТаблиц.Добавить(ИсходнаяТаблица.Скопировать());
		Возврат  МассивТаблиц;
	КонецЕсли;      	
	
	МассивСтрок = Новый Массив;
	Для х = 1 По СтрокВсего Цикл   
		
		МассивСтрок.Добавить(ИсходнаяТаблица[х-1]);
		
		Если (х % СтрокНаТаблицу) = 0 Тогда
			МассивТаблиц.Добавить(ИсходнаяТаблица.Скопировать(МассивСтрок));
			МассивСтрок.Очистить();
		КонецЕсли;	
		
	КонецЦикла;    	
	
	Если не МассивСтрок.Количество() = 0 Тогда
		МассивТаблиц.Добавить(ИсходнаяТаблица.Скопировать(МассивСтрок));		
	КонецЕсли;
	
	Возврат МассивТаблиц;
	
КонецФункции

Функция ПеременнаяСодержитСвойство(Переменная, ИмяСвойства) Экспорт
	
	// Инициализируем структуру для теста с ключом (значение переменной "ИмяСвойства") и значением NULL
	СтруктураПроверка = Новый Структура;
	СтруктураПроверка.Вставить(ИмяСвойства, NULL);
	
	// Заполняем созданную структуру из переданного значения переменной
	
		ЗаполнитьЗначенияСвойств(СтруктураПроверка, Переменная);
		
	// Если значение для свойства структуры осталось NULL, то искомое свойство не найдено, и наоборот.
	Если СтруктураПроверка[ИмяСвойства]= NULL Тогда
	      Возврат Ложь;
	Иначе
	      Возврат Истина;
	КонецЕсли;     
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////
// Сравнение номеров версий конфигурации

Функция СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2) Экспорт
	
	Строка1 = ?(ПустаяСтрока(СтрокаВерсии1), "0.0.0.0", СтрокаВерсии1);
	Строка2 = ?(ПустаяСтрока(СтрокаВерсии2), "0.0.0.0", СтрокаВерсии2);
	Версия1 = ПолучитьМассивСтрок(Строка1, ".");
	Если Версия1.Количество() <> 4 Тогда
		ВызватьИсключение ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неправильный формат параметра СтрокаВерсии1: %1'"), СтрокаВерсии1);
	КонецЕсли;
	Версия2 = ПолучитьМассивСтрок(Строка2, ".");
	Если Версия2.Количество() <> 4 Тогда
		ВызватьИсключение ПодставитьПараметрыВСтроку(
	    	НСтр("ru = 'Неправильный формат параметра СтрокаВерсии2: %1'"), СтрокаВерсии2);
	КонецЕсли;
	
	Результат = 0;
	Для Разряд = 0 По 3 Цикл
		Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
		Если Результат <> 0 Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивСтрок(ПодстрокаПоиска, Разделитель) Экспорт
	
	МассивСтрок = Новый Массив;
	
	Строки = СтрЗаменить(ПодстрокаПоиска, Разделитель, Символы.ПС);
	Для Индекс = 1 По СтрЧислоСтрок(Строки) Цикл
		МассивСтрок.Добавить((СтрПолучитьСтроку(Строки, Индекс)));
	КонецЦикла;
	
	Возврат МассивСтрок;
 	
КонецФункции

Функция ПодставитьПараметрыВСтроку(Знач СтрокаПодстановки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) Экспорт
	
	ИспользоватьАльтернативныйАлгоритм = 
		Найти(Параметр1, "%")
		Или Найти(Параметр2, "%")
		Или Найти(Параметр3, "%")
		Или Найти(Параметр4, "%")
		Или Найти(Параметр5, "%")
		Или Найти(Параметр6, "%")
		Или Найти(Параметр7, "%")
		Или Найти(Параметр8, "%")
		Или Найти(Параметр9, "%");
		
	Если ИспользоватьАльтернативныйАлгоритм Тогда
		СтрокаПодстановки = ПодставитьПараметрыВСтрокуАльтернативныйАлгоритм(СтрокаПодстановки, Параметр1,
			Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7, Параметр8, Параметр9);
	Иначе
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%1", Параметр1);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%2", Параметр2);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%3", Параметр3);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%4", Параметр4);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%5", Параметр5);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%6", Параметр6);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%7", Параметр7);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%8", Параметр8);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%9", Параметр9);
	КонецЕсли;
	
	Возврат СтрокаПодстановки;
КонецФункции

Функция ПодставитьПараметрыВСтрокуАльтернативныйАлгоритм(Знач СтрокаПодстановки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено)
	
	Результат = "";
	Позиция = Найти(СтрокаПодстановки, "%");
	Пока Позиция > 0 Цикл 
		Результат = Результат + Лев(СтрокаПодстановки, Позиция - 1);
		СимволПослеПроцента = Сред(СтрокаПодстановки, Позиция + 1, 1);
		ПодставляемыйПараметр = "";
		Если СимволПослеПроцента = "1" Тогда
			ПодставляемыйПараметр =  Параметр1;
		ИначеЕсли СимволПослеПроцента = "2" Тогда
			ПодставляемыйПараметр =  Параметр2;
		ИначеЕсли СимволПослеПроцента = "3" Тогда
			ПодставляемыйПараметр =  Параметр3;
		ИначеЕсли СимволПослеПроцента = "4" Тогда
			ПодставляемыйПараметр =  Параметр4;
		ИначеЕсли СимволПослеПроцента = "5" Тогда
			ПодставляемыйПараметр =  Параметр5;
		ИначеЕсли СимволПослеПроцента = "6" Тогда
			ПодставляемыйПараметр =  Параметр6;
		ИначеЕсли СимволПослеПроцента = "7" Тогда
			ПодставляемыйПараметр =  Параметр7
		ИначеЕсли СимволПослеПроцента = "8" Тогда
			ПодставляемыйПараметр =  Параметр8;
		ИначеЕсли СимволПослеПроцента = "9" Тогда
			ПодставляемыйПараметр =  Параметр9;
		КонецЕсли;
		Если ПодставляемыйПараметр = "" Тогда
			Результат = Результат + "%";
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 1);
		Иначе
			Результат = Результат + ПодставляемыйПараметр;
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 2);
		КонецЕсли;
		Позиция = Найти(СтрокаПодстановки, "%");
	КонецЦикла;
	Результат = Результат + СтрокаПодстановки;
	
	Возврат Результат;
КонецФункции           

// Сравнение номеров версий конфигурации
////////////////////////////////////////////////////////////////////////////////////////

// Сравнивает элементы списков значений или массивов по значениям.
//
// Параметры:
//  Список1 - Массив, СписокЗначений - сравниваемая коллекция элементов.
//  Список2 - Массив, СписокЗначений - сравниваемая коллекция элементов.
//
// Возвращаемое значение:
//  Булево - Истина, если идентичны.
//
Функция СпискиЗначенийИдентичны(Список1, Список2) Экспорт
	
	СпискиИдентичны = Истина;
	
	Для Каждого ЭлементСписка1 Из Список1 Цикл
		Если НайтиВСписке(Список2, ЭлементСписка1) = Неопределено Тогда
			СпискиИдентичны = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если СпискиИдентичны Тогда
		Для Каждого ЭлементСписка2 Из Список2 Цикл
			Если НайтиВСписке(Список1, ЭлементСписка2) = Неопределено Тогда
				СпискиИдентичны = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СпискиИдентичны;
	
КонецФункции

// Выполняет поиск элемента в коллекции: списке значений или массиве.
//
Функция НайтиВСписке(Список, Элемент)
	
	Перем ЭлементВСписке;
	
	Если ТипЗнч(Список) = Тип("СписокЗначений") Тогда
		Если ТипЗнч(Элемент) = Тип("ЭлементСпискаЗначений") Тогда
			ЭлементВСписке = Список.НайтиПоЗначению(Элемент.Значение);
		Иначе
			ЭлементВСписке = Список.НайтиПоЗначению(Элемент);
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Список) = Тип("Массив") Тогда
		ЭлементВСписке = Список.Найти(Элемент);
	КонецЕсли;
	
	Возврат ЭлементВСписке;
	
КонецФункции

// Считает продолжительность периода времени
// Параметры:
//	Параметр1 - Дата - Начало периода времени
//			  - Число - Продолжительность периода времени в секундах
//	Параметр2 - Дата - Окончание периода времени - Если 1й параметр типа "Дата"
//			  - Булево - Истина (в сутках, в часах, минутах, секундах); Ложь (часах, минутах, секундах) - Если 1й параметр типа "Число"
//	Параметр3 - Булево - Истина (в сутках, в часах, минутах, секундах); Ложь (часах, минутах, секундах) - Если 1й параметр типа "Дата
//			  - Строка - Если значение заполнено, оно добавляется перед результирующей строкой - Если 1й параметр типа "Число"
//	Параметр4 - Строка - Если значение заполнено, оно добавляется перед результирующей строкой - Если 1й параметр типа "Дата"
//			  - Булево - Истина (со строковым представлением частей); Ложь (с символом ":" в качестве разделителя частей) - Если 1й параметр типа "Число"
//	Параметр5 - Булево - Истина (со строковым представлением частей); Ложь (с символом ":" в качестве разделителя частей) - Если 1й параметр типа "Дата"
// Возвращаемое значение:
//	Строка
// Пример:
//	ПосчитатьПродолжительностьПериодаВремени('20210101', '20210102') = "1 сут."
//	ПосчитатьПродолжительностьПериодаВремени('20210101', '20210102', Ложь, "Продолжительность: ") = "Продолжительность: 24 час."
//	ПосчитатьПродолжительностьПериодаВремени(108000) = "3 час."
//	ПосчитатьПродолжительностьПериодаВремени(108000, Ложь, "", Ложь) = "03:00"
Функция ПосчитатьПродолжительностьПериодаВремени(Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено, Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено) Экспорт
	Если ТипЗнч(Параметр1) = Тип("Число") Тогда
		ПродолжительностьВСекундах = Параметр1;
		
		Если ЗначениеЗаполнено(Параметр2) Тогда
			ОпТ_Булево = Новый ОписаниеТипов("Булево");
			ПродолжительностьВСутках = ОпТ_Булево.ПривестиЗначение(Параметр2);
		Иначе
			ПродолжительностьВСутках = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметр3) Тогда
			ОпТ_Строка = Новый ОписаниеТипов("Строка");
			ЗаголовокСтроки = ОпТ_Строка.ПривестиЗначение(Параметр3);
		Иначе
			ЗаголовокСтроки = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметр4) Тогда
			ОпТ_Булево = Новый ОписаниеТипов("Булево");
			СтроковоеПредставление = ОпТ_Булево.ПривестиЗначение(Параметр4);
		Иначе
			СтроковоеПредставление = Истина;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Параметр1) = Тип("Дата") Тогда
		ДатаНач = Параметр1;
		ДатаКон = Параметр2;
		Если ЗначениеЗаполнено(ДатаНач) И Не ЗначениеЗаполнено(ДатаКон) Тогда
			ДатаКон = ТекущаяДата();
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ДатаНач) И Не ЗначениеЗаполнено(ДатаКон) Или ДатаНач > ДатаКон Тогда
			Возврат Неопределено;
		КонецЕсли;
		ПродолжительностьВСекундах = ДатаКон - ДатаНач;
		
		Если ЗначениеЗаполнено(Параметр3) Тогда
			ОпТ_Булево = Новый ОписаниеТипов("Булево");
			ПродолжительностьВСутках = ОпТ_Булево.ПривестиЗначение(Параметр3);
		Иначе
			ПродолжительностьВСутках = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметр4) Тогда
			ОпТ_Строка = Новый ОписаниеТипов("Строка");
			ЗаголовокСтроки = ОпТ_Строка.ПривестиЗначение(Параметр4);
		Иначе
			ЗаголовокСтроки = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметр5) Тогда
			ОпТ_Булево = Новый ОписаниеТипов("Булево");
			СтроковоеПредставление = ОпТ_Булево.ПривестиЗначение(Параметр5);
		Иначе
			СтроковоеПредставление = Истина;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не СтроковоеПредставление Тогда
		ПродолжительностьВСутках = Ложь;
	КонецЕсли;
	
	Если ПродолжительностьВСутках Тогда
		Суток = Цел(ПродолжительностьВСекундах / 86400);
		ПродолжительностьВСекундах = ПродолжительностьВСекундах % 86400;
	Иначе
		Суток = 0;
	КонецЕсли;
	Часов = Цел(ПродолжительностьВСекундах / 3600);
	ПродолжительностьВСекундах = ПродолжительностьВСекундах % 3600;
	Минут = Цел(ПродолжительностьВСекундах / 60);
	Секунд = ПродолжительностьВСекундах % 60;
	
	Если СтроковоеПредставление Тогда
		РезФункции = ?(Суток = 0, "", Формат(Суток, "ЧГ=") + " сут. ") + ?(Часов = 0, "", Формат(Часов, "ЧГ=") + " час. ") + ?(Минут = 0, "", Формат(Минут, "") + " мин. ") + ?(Секунд = 0, "", Формат(Секунд, "") + " сек.");
	Иначе
		РезФункции = Формат(Часов, "ЧГ=; ЧН=00") + ":" + Формат(Минут, "ЧЦ=2; ЧН=; ЧВН=") + ?(Секунд = 0, "", ":" + Формат(Секунд, "ЧЦ=2; ЧН=; ЧВН="));
	КонецЕсли;
	
	Если Не ПустаяСтрока(ЗаголовокСтроки) И Не ПустаяСтрока(РезФункции) Тогда
		РезФункции = ЗаголовокСтроки + РезФункции;
	КонецЕсли;
	
	Возврат РезФункции;
КонецФункции // ПосчитатьПродолжительностьВремениОтключения

Процедура УстановитьНастройкиЭлементовФормы(Форма, Знач СтруктураНастроекЭлементов = Неопределено, ОбработатьОстальныеЭлементы = Ложь, НастройкиОстальныхЭлементов = Неопределено, ЧерезПопыткуИсключение = Истина) Экспорт
	Если ТипЗнч(СтруктураНастроекЭлементов) = Тип("Структура")
	Или ТипЗнч(СтруктураНастроекЭлементов) = Тип("ФиксированнаяСтруктура")
	Тогда
		// Все ОК
	ИначеЕсли ТипЗнч(СтруктураНастроекЭлементов) = Тип("Соответствие")
	Или ТипЗнч(СтруктураНастроекЭлементов) = Тип("ФиксированноеСоответствие")
	Тогда
		НастройкиЭлементов = Новый Структура;
		Для Каждого КЗ Из СтруктураНастроекЭлементов Цикл
			НастройкиЭлементов.Вставить(КЗ.Ключ, КЗ.Значение);
		КонецЦикла;
		СтруктураНастроекЭлементов = НастройкиЭлементов;
	Иначе
		СтруктураНастроекЭлементов = Новый Структура;
	КонецЕсли;
	
	Для Каждого КЗ Из СтруктураНастроекЭлементов Цикл
		ЭлемФормы = Форма.Элементы.Найти(КЗ.Ключ);
		Если ЭлемФормы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(КЗ.Значение) = Тип("Строка") Тогда
			НастройкиЭлементов = СтрРазделить(КЗ.Значение, ";", Ложь);
			Для Каждого НастройкаЭлемента Из НастройкиЭлементов Цикл
				ПараметрыЭлемента = СтрРазделить(НастройкаЭлемента, ",", Ложь);
				Если ПараметрыЭлемента.Количество() < 2 Тогда
					Продолжить;
				КонецЕсли;
				
				УстановитьНастройкуЭлемента(ЭлемФормы, ПараметрыЭлемента[0], ПараметрыЭлемента[1], ЧерезПопыткуИсключение);
			КонецЦикла;
		ИначеЕсли ТипЗнч(КЗ.Значение) = Тип("Структура")
		Или ТипЗнч(КЗ.Значение) = Тип("ФиксированнаяСтруктура")
		Или ТипЗнч(КЗ.Значение) = Тип("Соответствие")
		Или ТипЗнч(КЗ.Значение) = Тип("ФиксированноеСоответствие")
		Тогда
			НастройкиЭлементов = КЗ.Значение;
			Для Каждого НастройкаЭлемента Из НастройкиЭлементов Цикл
				УстановитьНастройкуЭлемента(ЭлемФормы, НастройкаЭлемента.Ключ, НастройкаЭлемента.Значение, ЧерезПопыткуИсключение);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Если ОбработатьОстальныеЭлементы = Истина Тогда
		СтруктураНастроекОстальныхЭлементов = Новый Структура;
		Если ТипЗнч(НастройкиОстальныхЭлементов) = Тип("Строка") Тогда
			НастройкиЭлементов = СтрРазделить(НастройкиОстальныхЭлементов, ";", Ложь);
			Для Каждого НастройкаЭлемента Из НастройкиЭлементов Цикл
				ПараметрыЭлемента = СтрРазделить(НастройкаЭлемента, ",", Ложь);
				Если ПараметрыЭлемента.Количество() < 2 Тогда
					Продолжить;
				КонецЕсли;
				
				СтруктураНастроекОстальныхЭлементов.Вставить(ПараметрыЭлемента[0], ПараметрыЭлемента[1]);
			КонецЦикла;
		ИначеЕсли ТипЗнч(НастройкиОстальныхЭлементов) = Тип("Структура")
		Или ТипЗнч(НастройкиОстальныхЭлементов) = Тип("ФиксированнаяСтруктура")
		Или ТипЗнч(НастройкиОстальныхЭлементов) = Тип("Соответствие")
		Или ТипЗнч(НастройкиОстальныхЭлементов) = Тип("ФиксированноеСоответствие")
		Тогда
			СтруктураНастроекОстальныхЭлементов = НастройкиОстальныхЭлементов;
		КонецЕсли;
		
		Если СтруктураНастроекОстальныхЭлементов.Количество() Тогда
			Для Каждого ЭлемФормы Из Форма.Элементы Цикл
				Если СтруктураНастроекЭлементов.Свойство(ЭлемФормы.Имя) Тогда
					Продолжить;
				ИначеЕсли ТипЗнч(ЭлемФормы) = Тип("ГруппаФормы") Тогда
					Продолжить;
				КонецЕсли;
				
				Для Каждого КЗ Из СтруктураНастроекОстальныхЭлементов Цикл
					УстановитьНастройкуЭлемента(ЭлемФормы, КЗ.Ключ, КЗ.Значение, ЧерезПопыткуИсключение);
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // УстановитьНастройкиЭлементовФормы

Процедура УстановитьНастройкуЭлемента(ЭлемФормы, ИмяНастройки, ЗначениеНастройки, ЧерезПопыткуИсключение = Истина) Экспорт
	Если ЧерезПопыткуИсключение = Истина Тогда
		Попытка
			ТипНастройки = Новый Массив;
			ТипНастройки.Добавить(ТипЗнч(ЭлемФормы[ИмяНастройки]));
			ОпТ = Новый ОписаниеТипов(ТипНастройки);
			
			ЭлемФормы[ИмяНастройки] = ОпТ.ПривестиЗначение(ЗначениеНастройки);
		Исключение
		КонецПопытки;
	Иначе
		ТипНастройки = Новый Массив;
		ТипНастройки.Добавить(ТипЗнч(ЭлемФормы[ИмяНастройки]));
		ОпТ = Новый ОписаниеТипов(ТипНастройки);
		
		ЭлемФормы[ИмяНастройки] = ОпТ.ПривестиЗначение(ЗначениеНастройки);
	КонецЕсли;
КонецПроцедуры // УстановитьНастройкуЭлемента

// Процедура заполняет список выбора времени.
// Параметры:
//  ПолеВводаФормы  - элемент-владелец списка,
//  Интервал        - интервал, с которым необходимо заполнить список, по умолчанию час.
Процедура ЗаполнитьСписокВыбораВремени(ПолеВводаФормы, Интервал = 3600, Начало = '00010101080000', Окончание = '00010101200000') Экспорт
	
	СписокВремен = ПолеВводаФормы.СписокВыбора;
	СписокВремен.Очистить();
	
	ВремяСписка = НачалоЧаса(Начало);
	
	Пока НачалоЧаса(ВремяСписка) <= НачалоЧаса(Окончание) Цикл
		
		Если НЕ ЗначениеЗаполнено(ВремяСписка) Тогда
			ПредставлениеВремени = "00:00";
		Иначе
			ПредставлениеВремени = Формат(ВремяСписка,"ДФ=ЧЧ:мм");
		КонецЕсли;
		
		СписокВремен.Добавить(ВремяСписка, ПредставлениеВремени);
		
		ВремяСписка = ВремяСписка + Интервал;
		
	КонецЦикла;
	
КонецПроцедуры

// Сравнение номеров версий конфигурации
////////////////////////////////////////////////////////////////////////////////////////
