#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрочитатьПараметрыРЗ("ум_МногопоточныйКонвейерОбработкаПакетов",   "РЗ_Обработка");
	ПрочитатьПараметрыРЗ("ум_МногопоточныйКонвейерОбслуживаниеСистемы", "РЗ_Обслуживание");
	ПрочитатьПараметрыРЗ("ум_МногопоточныйКонвейерКонтрольРабочихФЗ",   "РЗ_КонтрольРабочихФЗ");
	
	КонстантыУмов.ум_ВключитьЛогированиеФЗ = Константы.ум_ВключитьЛогированиеФЗ.Получить();
	КонстантыУмов.ум_ТаймаутУдаленияЛоговФЗ = Константы.ум_ТаймаутУдаленияЛоговФЗ.Получить();

	ЗаполнитьИсториюРаботыРЗ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастройкаФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РЗ_Обработка_ИспользованиеПриИзменении(Элемент)
	
	УстановитьМодифицированность("РЗ_Обработка");
	
КонецПроцедуры

&НаКлиенте
Процедура РЗ_Обслуживание_ИспользованиеПриИзменении(Элемент)
	
	УстановитьМодифицированность("РЗ_Обслуживание");
	
КонецПроцедуры

&НаКлиенте
Процедура РЗ_КонтрольРабочихФЗ_ИспользованиеПриИзменении(Элемент)
	
	УстановитьМодифицированность("РЗ_КонтрольРабочихФЗ");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РЗ_Обслуживание_НастроитьРасписание(Команда)
	
	НастроитьРасписание("РЗ_Обслуживание");
	
КонецПроцедуры

&НаКлиенте
Процедура РЗ_Обработка_НастроитьРасписание(Команда)
	
	НастроитьРасписание("РЗ_Обработка");
	
КонецПроцедуры

&НаКлиенте
Процедура РЗ_КонтрольРабочихФЗ_НастроитьРасписание(Команда)
	
	НастроитьРасписание("РЗ_КонтрольРабочихФЗ");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТЧРегламентныеЗадания(Команда)
	
	ЗаполнитьИсториюРаботыРЗ();
	
КонецПроцедуры

&НаКлиенте
Процедура РЗ_Обслуживание_Сохранить(Команда)
	
	СохранитьПараметрыРЗНаСервере("ум_МногопоточныйКонвейерОбслуживаниеСистемы", "РЗ_Обслуживание");
	НастройкаФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура РЗ_Обработка_Сохранить(Команда)
	
	СохранитьПараметрыРЗНаСервере("ум_МногопоточныйКонвейерОбработкаПакетов", "РЗ_Обработка");
	НастройкаФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура РЗ_КонтрольРабочихФЗ_Сохранить(Команда)
	
	СохранитьПараметрыРЗНаСервере("ум_МногопоточныйКонвейерКонтрольРабочихФЗ", "РЗ_КонтрольРабочихФЗ");
	НастройкаФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура Константыум_ЛогированиеФЗПриИзменении(Элемент)
	Константыум_ПриЗмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Константыум_ТаймаутУдаленияЛоговФЗПриИзменении(Элемент)
	Константыум_ПриЗмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнитьПервоначальноеЗаполнениеНастроек(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПервоначальноеЗаполнение", ЭтотОбъект, Параметры);
	ТекстВопроса = НСтр("ru = 'Выполнить первоначальное заполнение настроек?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастройкаФормы()
	
	Элементы.РЗ_Обработка_Сохранить.Доступность = РЗ_Обработка_Модифицированность;
	Элементы.РЗ_Обслуживание_Сохранить.Доступность = РЗ_Обслуживание_Модифицированность;
	Элементы.РЗ_КонтрольРабочихФЗ_Сохранить.Доступность = РЗ_КонтрольРабочихФЗ_Модифицированность;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьМодифицированность(ИмяРеквизита)
	
	ЭтотОбъект[ИмяРеквизита + "_Модифицированность"] = Истина;
	НастройкаФормы();
	
КонецПроцедуры   

&НаКлиенте
Процедура НастроитьРасписание(ИмяРеквизита)
	
	Расписание = ЭтотОбъект[ИмяРеквизита + "_Расписание"];
	Если ТипЗнч(Расписание) <> Тип("РасписаниеРегламентногоЗадания") Тогда
		Расписание = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	Оповещение = Новый ОписаниеОповещения("ЗавершениеНастройкиРасписания", ЭтотОбъект, ИмяРеквизита);
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеНастройкиРасписания(НовоеРасписание, ИмяРеквизита) Экспорт

	Если НовоеРасписание <> Неопределено Тогда
		ЭтотОбъект[ИмяРеквизита + "_Расписание"] = НовоеРасписание;
		УстановитьМодифицированность(ИмяРеквизита);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПараметрыРЗ(ИмяЗадания, ИмяРеквизита)
	
	РЗ = РегламентныеЗадания.НайтиПредопределенное(ИмяЗадания);
	Если РЗ <> Неопределено Тогда
		ЭтотОбъект[ИмяРеквизита + "_Модифицированность"] = Ложь;
		ЭтотОбъект[ИмяРеквизита + "_Расписание"] = РЗ.Расписание;
		ЭтотОбъект[ИмяРеквизита + "_Использование"] = РЗ.Использование;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьПараметрыРЗНаСервере(ИмяЗадания, ИмяРеквизита)
	
	Задание = РегламентныеЗадания.НайтиПредопределенное(ИмяЗадания);
	Если Задание <> Неопределено Тогда
		Задание.Использование = ЭтотОбъект[ИмяРеквизита + "_Использование"];
		Задание.Расписание    = ЭтотОбъект[ИмяРеквизита + "_Расписание"];
		Задание.Записать();
		ЭтотОбъект[ИмяРеквизита + "_Модифицированность"] = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсториюРаботыРЗ()
	
	ДанныеРегламентныхЗаданий.Очистить();

	КлючиРЗ = Новый Соответствие;
	ДобавитьКлючРЗВСоответствие(КлючиРЗ, "ум_МногопоточныйКонвейерОбработкаПакетов");
	ДобавитьКлючРЗВСоответствие(КлючиРЗ, "ум_МногопоточныйКонвейерОбслуживаниеСистемы");
	ДобавитьКлючРЗВСоответствие(КлючиРЗ, "ум_МногопоточныйКонвейерКонтрольРабочихФЗ");	
	
	Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания();
	Для Каждого Задание Из Задания Цикл
		
		РЗПредставление = КлючиРЗ.Получить(Задание.ИмяМетода);
		Если РЗПредставление = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтрока = ДанныеРегламентныхЗаданий.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Задание);
		
		РассчитатьДлительность(НовСтрока);
		
		Если Не ЗначениеЗаполнено(НовСтрока.Наименование) Тогда
			НовСтрока.Наименование = РЗПредставление;
		КонецЕсли;
			
		Если Задание.ИнформацияОбОшибке <> Неопределено Тогда
			НовСтрока.Ошибка = ПодробноеПредставлениеОшибки(Задание.ИнформацияОбОшибке);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКлючРЗВМассив(МассивКлючей, ИмяЗадания)
	
	РЗ = РегламентныеЗадания.НайтиПредопределенное(ИмяЗадания);
	Если РЗ <> Неопределено Тогда
		МассивКлючей.Добавить(РЗ.Ключ);
	Иначе
		ВызватьИсключение "Не найдено предопределенное регламентное задание с именем " + ИмяЗадания;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКлючРЗВСоответствие(СоответствиеКлючей, ИмяЗадания)
	
	РЗ = РегламентныеЗадания.НайтиПредопределенное(ИмяЗадания);
	Если РЗ <> Неопределено Тогда
		РЗПредставление = РЗ.Метаданные.Представление();
		СоответствиеКлючей.Вставить(РЗ.Метаданные.ИмяМетода, РЗПредставление);
	Иначе
		ВызватьИсключение "Не найдено предопределенное регламентное задание с именем " + ИмяЗадания;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// ТУДУ сделать вызов без контекста, параметры передать явно с клиента.
Процедура Константыум_ПриЗмененииНаСервере()
	Константы.ум_ВключитьЛогированиеФЗ.Установить(КонстантыУмов.ум_ВключитьЛогированиеФЗ);
	Константы.ум_ТаймаутУдаленияЛоговФЗ.Установить(КонстантыУмов.ум_ТаймаутУдаленияЛоговФЗ);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПервоначальноеЗаполнение(Результат, Параметры) Экспорт
	
	Если Не Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьПервоначальноеЗаполнениеНастроекНаСервере();
	ТекстСообщения = "Выполнено первоначальное заполнение настроек";
	ПоказатьОповещениеПользователя("Операция успешно выполнена",
								   ,
								   ТекстСообщения,
								   // БиблиотекаКартинок.ОформлениеЗнакФлажок
	);
	
КонецПроцедуры

&НаСервере 
Процедура ВыполнитьПервоначальноеЗаполнениеНастроекНаСервере()
	Перем ТекстОшибки;
	НачатьТранзакцию();
	Попытка
		// 1. Инициализация предопределенных элементов способов обработки пакетов
		Справочники.ум_СпособыОбработкиПакетов.ИнициализацияПредопределенныхЭлементовСпособовОбработкиПакетов();
		// 2. Инициализация предопределенных элементов описания ошибок обработки пакетов
		Справочники.ум_ОписанияОшибокОбработкиПакетов.ИнициализацияПредопределенныхЭлементовОписанияОшибокОбработкиПакетов();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ОписаниеОшибки();
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура РассчитатьДлительность(СтрокаРЗ)
	Если ЗначениеЗаполнено(СтрокаРЗ.Конец) Тогда
		ДлительностьСекунд = СтрокаРЗ.Конец - СтрокаРЗ.Начало;
		СтрокаРЗ.Длительность = Формат(Дата(1,1,1) + ДлительностьСекунд, "ДЛФ=T");
	Иначе
		СтрокаРЗ.Длительность = "Не определено";
	КонецЕСли;
КонецПроцедуры

&НаСервере
Функция НаименованиеРегламентногоЗадания(Задание)
	
	Результат = Задание.Наименование;
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	РегламентноеЗадание = Задание.РегламентноеЗадание;
	Если Не РегламентноеЗадание = Неопределено Тогда
		Результат = РегламентноеЗадание.Метаданные.Представление();
	Иначе
		Результат = НСтр("ru = '<пусто>'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
