
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ЗначениеСвойства;
	
	// переносим параметры выбора в список
	Если Параметры.Свойство("РежимВыбора", ЗначениеСвойства) Тогда
		Элементы.Список.РежимВыбора = ЗначениеСвойства;
	КонецЕсли;
	
	Если Параметры.Свойство("МножественныйВыбор", ЗначениеСвойства) И Не ЗначениеСвойства = Неопределено Тогда
		Элементы.Список.МножественныйВыбор = ЗначениеСвойства;
	КонецЕсли;
	
	Если Параметры.Свойство("ВыборГруппИЭлементов", ЗначениеСвойства) Тогда
		Элементы.Список.ВыборГруппИЭлементов = ЗначениеСвойства;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВключитьАктивность(Команда)
	УстановитьАктивность(Истина);
	ОповеститьОбИзменении(Тип("СправочникСсылка.ум_СпособыОбработкиПакетов"));
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыключитАктивность(Команда)
	УстановитьАктивность(Ложь);
	ОповеститьОбИзменении(Тип("СправочникСсылка.ум_СпособыОбработкиПакетов"));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьАктивность(Значение)
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если ум_ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, "8.5.1.0") > 0 Тогда
		МассивСсылок = Элементы.Список.ПолучитьСтрокиДляОбработки();
	Иначе
		МассивСсылок = Элементы.Список.ВыделенныеСтроки;
	КонецЕсли;
	
	УстановитьАктивностьНаСервере(МассивСсылок, Значение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьАктивностьНаСервере(МассивСсылок, Значение)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ум_СпособыОбработкиПакетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ум_СпособыОбработкиПакетов КАК ум_СпособыОбработкиПакетов
	|ГДЕ
	|	ум_СпособыОбработкиПакетов.Ссылка В(&МассивСсылок)
	|	И НЕ ум_СпособыОбработкиПакетов.ЭтоГруппа";
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		
		Объект = ВыборкаЗапроса.Ссылка.ПолучитьОбъект();
		Объект.Активность = Значение;
		Объект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

