#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	КонтрольЗаполнениеИмениДляРазработчика(Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьЗначениеКонстанты();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Предопределенный Тогда
		
		// удалим проверку имени процедуры
		Индекс = ПроверяемыеРеквизиты.Найти("ИмяФункции");
		Если НЕ Индекс = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Индекс);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИмяДляРазработчика = "";
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий()

#Область СлужебныеПроцедурыИФункции

Процедура КонтрольЗаполнениеИмениДляРазработчика(Отказ) 
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИмяДляРазработчика) Тогда
		
		ИмяДляРазработчика = ум_ПакетыДанныхОбщегоНазначения.УникальноеИмяДляРазработчика(Наименование, Ссылка);
		
	ИначеЕсли НЕ ДополнительныеСвойства.Свойство("ПроверкаИмениДляРазработчикаВыполнена") Тогда
		
		ум_ПакетыДанныхОбщегоНазначения.ПроверитьУникальностьИмяДляРазработчика(ИмяДляРазработчика, Ссылка, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьЗначениеКонстанты()
	Перем ДатаУстановкиЗначения, ЗначениеКонстанты;
	
	ЗаписьВозможна = ДополнительныеСвойства.Свойство("ЗначениеКонстанты", ЗначениеКонстанты) И
	ДополнительныеСвойства.Свойство("ДатаУстановкиЗначения", ДатаУстановкиЗначения);
	Если Не ЗаписьВозможна Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ум_ЗначенияКонстант.СоздатьНаборЗаписей();
	Запись = НаборЗаписей.Добавить();
	Запись.Период    = ДатаУстановкиЗначения;
	Запись.Константа = Ссылка;
	Запись.Значение  = ЗначениеКонстанты;
	
	// 1. Установим блокировку
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ум_ЗначенияКонстант");
	ЭлементБлокировки.УстановитьЗначение("Константа", Ссылка);
	ЭлементБлокировки.УстановитьЗначение("Период",    ДатаУстановкиЗначения);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	// 2. Определим режим записи
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",    ДатаУстановкиЗначения);
	Запрос.УстановитьПараметр("Константа", Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ум_ЗначенияКонстант.Период КАК Период,
	|	ум_ЗначенияКонстант.Константа КАК Константа,
	|	ум_ЗначенияКонстант.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ум_ЗначенияКонстант КАК ум_ЗначенияКонстант
	|ГДЕ
	|	ум_ЗначенияКонстант.Период = &Период
	|	И ум_ЗначенияКонстант.Константа = &Константа";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		РежимЗамещенияНабора = РежимЗамещения.Добавление;
	Иначе
		РежимЗамещенияНабора = РежимЗамещения.Обновление;
	КонецЕсли;
	
	// 3. Запишим
	НаборЗаписей.Записать(РежимЗамещенияНабора);
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли