//////////////////////////////////////////////////////////////////////////////////
//
// форма предназначена для отображения состояния фонового задания
// Параметры передаваемые на форму:
//   1. ИдентификаторЗадания  <Уникальный идентификатор> - УИД фонового задания
//   2. АвтоЗакрытие  <Булево> - флаг авто закрытия формы, если Истина то при завершении фонового
//                               задания форма закроется автоматически.
//
// Cообщения между формой и фоновым заданием передаются с помощью сообщений пользователя: Новый СообщениеПользователю;
// в текст сообщения надо передавать структуру через ЗначениеВСтрокуВнутр, остальные параметры сообщения не важны
// передаваемая структура:
//     ТекстСообщения - текст сообщения выводимого в верхней части окна формы;
//     ТекстОписания  - текст описания выводимоuj в нижней части окна формы;
//     Прогресс - значение прогресса (процент выполнения), если этого параметра нет то прогресс бар выводится не будет
//

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИдентификаторЗадания") Тогда
		ИдентификаторЗадания = Параметры.ИдентификаторЗадания;
		Статус = "Активно";
	КонецЕсли;
	
	Если Параметры.Свойство("АвтоЗакрытие") Тогда
		АвтоЗакрытие = Параметры.АвтоЗакрытие;
	КонецЕсли;
	
	Если Параметры.Свойство("ТекстСообщения") Тогда
		Элементы.ДекорацияПоясняющийТекст.Заголовок = Параметры.ТекстСообщения;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОжиданиеСозданияПакетов();
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий элементов формы
#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОтмена(Команда)
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ЗакрытьФорму();
	Иначе
		ОтменитЗаданиеНаСервере();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтменитЗаданиеНаСервере()
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Если Не Задание = Неопределено Тогда
		Задание.Отменить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОжиданиеСозданияПакетов()
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		Возврат;
	КонецЕсли;
	
	Задание = ПолучитьДанныеФоновогоЗадания(ИдентификаторЗадания);
	Если Задание.Активно Тогда
		ПодключитьОбработчикОжидания("ОжиданиеСозданияПакетов", 1, Истина);
		Статус = "Активно";
	Иначе
		ИдентификаторЗадания = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
		Элементы.Отмена.Заголовок = "Закрыть";
	КонецЕсли;
	
	ОбработатьСообщенияПользователю(Задание);
	
	Если Задание.ЗавершеноАварийно Тогда
		ИнформацияОбОшибке = Задание.ИнформацияОбОшибке;
		Текст = "Ошибка: " + ИнформацияОбОшибке.Описание + Символы.ПС +
		"Имя модуля: " + ИнформацияОбОшибке.ИмяМодуля + Символы.ПС +
		"Номер строки: " + ИнформацияОбОшибке.НомерСтроки + Символы.ПС +
		"Исходная строка: " + ИнформацияОбОшибке.ИсходнаяСтрока + Символы.ПС +
		"Код: " + ИнформацияОбОшибке.Код;
		ПоказатьПредупреждение(, Текст);
	Иначе
		Если АвтоЗакрытие И Не Задание.Активно Тогда
			ЗакрытьФорму();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеФоновогоЗадания(ИдентификаторЗадания)
	Перем ИнформацияОбОшибке, СтруктраСообщения;
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	
	Если Не Задание = Неопределено Тогда
		ЗаданиеАктивно    = Задание.Состояние = СостояниеФоновогоЗадания.Активно;
		ЗаданиеЗавершено  = Задание.Состояние = СостояниеФоновогоЗадания.Завершено;
		ЗаданиеОтменено   = Задание.Состояние = СостояниеФоновогоЗадания.Отменено;
		ЗавершеноАварийно = Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно;
		МассивСообщений   = Задание.ПолучитьСообщенияПользователю(Истина);
		
		Если ЗначениеЗаполнено(МассивСообщений) Тогда
			Сообщение = МассивСообщений[МассивСообщений.ВГраница()];
			Если ЗначениеЗаполнено(Сообщение.Текст) Тогда
				Попытка
					СтруктраСообщения = ЗначениеИзСтрокиВнутр(Сообщение.Текст);
				Исключение
					СтруктраСообщения = Неопределено;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗавершеноАварийно Тогда
			ИнформацияОбОшибке = Задание.ИнформацияОбОшибке;
		КонецЕсли;
	Иначе
		ЗаданиеАктивно    = Ложь;
		ЗаданиеЗавершено  = Истина;
		ЗаданиеОтменено   = Ложь;
		ЗавершеноАварийно = Ложь;
		МассивСообщений   = Новый Массив;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Активно",    ЗаданиеАктивно);
	Результат.Вставить("Завершено",  ЗаданиеЗавершено);
	Результат.Вставить("Отменено",   ЗаданиеОтменено);
	Результат.Вставить("Сообщение",  СтруктраСообщения);
	Результат.Вставить("ЗавершеноАварийно", ЗавершеноАварийно);
	Результат.Вставить("ИнформацияОбОшибке", ИнформацияОбОшибке);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьСообщенияПользователю(Задание)
	Перем Текст;
	
	ВыводитьПрогрессБар = Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПрогрессБар;
	ТекстОписания  = Описание;
	ТекстСообщения = Элементы.ДекорацияПоясняющийТекст.Заголовок;
	
	Сообщение = Задание.Сообщение;
	Если ЗначениеЗаполнено(Сообщение) Тогда
		
		Если Сообщение.Свойство("ТекстСообщения") Тогда
			ТекстСообщения = Сообщение.ТекстСообщения;
		КонецЕсли;
		
		Если Сообщение.Свойство("ТекстОписания") Тогда
			ТекстОписания = Сообщение.ТекстОписания;
		КонецЕсли;
		
		Если Сообщение.Свойство("Прогресс") Тогда
			Прогресс = Сообщение.Прогресс;
			ВыводитьПрогрессБар = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВыводитьПрогрессБар Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПрогрессБар;
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОсновное;
	КонецЕсли;
	Описание = ТекстОписания;
	
	Если Задание.Активно Тогда
		Текст = ТекстСообщения;
	ИначеЕсли Задание.Завершено Тогда
		Текст = "Успешно выполнено.";
		Статус = "Завершено";
	ИначеЕсли Задание.Отменено Тогда
		Текст = "Отменено пользователем.";
		Статус = "Отменено";
	ИначеЕсли Задание.ЗавершеноАварийно Тогда
		Текст = "Завершено с ошибками.";
		Статус = "ЗавершеноАварийно";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Текст) Тогда
		Элементы.ДекорацияПоясняющийТекст.Заголовок = Текст;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму()
	ПараметрЗакрытия = Новый Структура;
	ПараметрЗакрытия.Вставить("Статус", Статус);
	Закрыть(ПараметрЗакрытия);
КонецПроцедуры

#КонецОбласти
