
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем Данные, АдресХранилищаДанных, ТекстЗаголовка;
	
	// 1. Устанавлимаем заголовок
	Параметры.Свойство("Заголовок", ТекстЗаголовка);
	Если ЗначениеЗаполнено(ТекстЗаголовка) Тогда
		Заголовок = ТекстЗаголовка;
	КонецЕсли;
	
	// 2. Получаем данные из параметра
	Если Параметры.Свойство("АдресХранилищаДанных", АдресХранилищаДанных) Тогда	
		Данные = ПолучитьИзВременногоХранилища(АдресХранилищаДанных);
		УдалитьИзВременногоХранилища(АдресХранилищаДанных);
	Иначе
		Параметры.Свойство("Данные", Данные);
	КонецЕсли;
	
	// 3. Отображаем данные на форме
	ОтобразитьДанныеНаФорму(Данные);
	
	// 4. устанавливеим начальную видимости / доступности элемнтов
	ИнициализацияВидимостиДоступностиЭлемнтовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицаЗначенийФормы

&НаКлиенте
Процедура ТаблицаЗначенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьЗначениеПоля(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗначенийПриАктивизацииПоля(Элемент)
	ПриСменеПоляИлиСтроки(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗначенийПриАктивизацииСтроки(Элемент)
	ПриСменеПоляИлиСтроки(Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовДеревоЗначенийФормы

&НаКлиенте
Процедура ДеревоЗначенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьЗначениеПоля(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗначенийПриАктивизацииСтроки(Элемент)
	ПриСменеПоляИлиСтроки(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗначенийПриАктивизацииПоля(Элемент)
	ПриСменеПоляИлиСтроки(Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСкрытьПросмотр(Команда)
	
	УстановитьВидимостьТекстаРасшифровкиJSON(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьПросмотр(Команда)
	
	УстановитьВидимостьТекстаРасшифровкиJSON(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтобразитьДанныеНаФорму(ДанныеДляОтображения)
	
	Если ТипЗнч(ДанныеДляОтображения) = Тип("ХранилищеЗначения") Тогда
		Данные = ДанныеДляОтображения.Получить();
	Иначе
		Данные = ДанныеДляОтображения;
	КонецЕсли;
	
	ТипЗнч = ТипЗнч(Данные);
	Если ТипЗнч = Тип("Массив") Тогда
		ОтобразитьДанныеКакМассив(Данные);
	ИначеЕсли ТипЗнч = Тип("Структура") Тогда
		ОтобразитьДанныеКакСтруктура(Данные);
	ИначеЕсли ТипЗнч = Тип("Соответствие") Тогда
		ОтобразитьДанныеКакСоответствие(Данные);
	ИначеЕсли ТипЗнч = Тип("ТабличныйДокумент") Тогда
		ОтобразитьДанныеКакТабличныйДокумент(Данные);
	ИначеЕсли ТипЗнч = Тип("ТаблицаЗначений") Тогда
		ОтобразитьДанныеКакТаблицаЗначений(Данные);
	ИначеЕсли ТипЗнч = Тип("ДеревоЗначений") Тогда
		ОтобразитьДанныеКакДерево(Данные);
	ИначеЕсли ум_БСП_ОбщегоНазначения.ЭтоСсылка(ТипЗнч) Тогда 
		ОтобразитьДанныеКакСсылка(Данные);
	Иначе
		ОтобразитьДанныеКакТекст(Данные);
	КонецЕсли;
	
КонецПроцедуры // ОтобразитьДанныеНаФорму()

&НаСервере
Функция ОтобразитьДанныеКакМассив(Данные)
	
	ОтобразитьКоллекциюНаФорме(Данные);
	ТипДанных = "Массив";
	
	Возврат Истина;
	
КонецФункции // ОтобразитьДанныеКакМассив()

&НаСервере
Функция ОтобразитьДанныеКакСтруктура(Данные)
	
	ОтобразитьКоллекциюНаФорме(Данные);
	ТипДанных = "Структура";
	
	Возврат Истина;
	
КонецФункции // ОтобразитьДанныеКакСтруктура()

&НаСервере
Функция ОтобразитьДанныеКакСоответствие(Данные)
	
	ОтобразитьКоллекциюНаФорме(Данные);
	ТипДанных = "Соответствие";
	
	Возврат Истина;
	
КонецФункции // ОтобразитьДанныеКакСоответствие()

&НаСервере
Функция ОтобразитьДанныеКакТабличныйДокумент(Данные)
	
	ТабличныйДокумент.Вывести(Данные);
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаТабличныйДокумент; 
	ТипДанных = "ТабличныйДокумент";
	
	Возврат Истина;
	
КонецФункции // ОтобразитьДанныеКакТабличныйДокумент()

&НаСервере
Функция ОтобразитьДанныеКакТаблицаЗначений(Данные)
	
	СоздатьТаблицуЗначенийНаФорме(Данные);
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаТаблицаЗначений;
	ТипДанных = "ТаблицаЗначений";
	
	Возврат Истина;
	
КонецФункции // ОтобразитьДанныеКакТаблицаЗначений()

&НаСервере
Функция ОтобразитьДанныеКакДерево(Данные)
	
	СоздатьДеревоЗначенийНаФорме(Данные);
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДеревоЗначений;
	ТипДанных = "ДеревоЗначений";
	
	Возврат Истина;
	
КонецФункции // ОтобразитьДанныеКакДерево()

&НаСервере
Функция ОтобразитьДанныеКакСсылка(Данные)
	
	СсылкаДанных = Данные;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСсылка;	
	ТипДанных = СсылкаДанных.Метаданные().ПолноеИмя();
	
	Возврат Истина;
	
КонецФункции // ОтобразитьДанныеКакСсылка()

&НаСервере
Процедура ОтобразитьДанныеКакТекст(Данные)
	
	Текст = Данные;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаТекст; 
	ТипДанных = "Текст";
	
КонецПроцедуры // ОтобразитьДанныеКакТекст()

&НаСервере
Процедура ОтобразитьКоллекциюНаФорме(Данные)
	
	// это признак того что дерево сгенерированно на форме 
	// для масивва или структуры или соотетсвия 
	// и имеет определеные колонки: Ключ, Значение, ХранилищеЗначения
	ЭтоКоллекция = Истина;
	
	// заполним дерево значений из коллекции
	ПараметрДеревоЗначений = Новый ДеревоЗначений;
	ПараметрДеревоЗначений.Колонки.Добавить("Ключ");
	ПараметрДеревоЗначений.Колонки.Добавить("Значение");
	ПараметрДеревоЗначений.Колонки.Добавить("ХранилищеЗначения");
	
	ДобавитьКоллекциюВВетку(ПараметрДеревоЗначений.Строки, Данные);
	СоздатьДеревоЗначенийНаФорме(ПараметрДеревоЗначений);
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДеревоЗначений;
	
КонецПроцедуры // ОтобразитьКоллекциюНаФорме()

&НаСервере
Процедура ДобавитьКоллекциюВВетку(Ветка, ЗначениеВетки)
	
	Индекс = 0;
	Для каждого КлючЗначение Из ЗначениеВетки Цикл
		
		СтрокаВетки = Ветка.Добавить();
		Если ТипЗнч(ЗначениеВетки) = Тип("Массив") Тогда
			СтрокаВетки.Ключ = Формат(Индекс, "ЧН=0; ЧГ=");
			Значение = КлючЗначение;
		Иначе
			СтрокаВетки.Ключ = КлючЗначение.Ключ;
			Значение = КлючЗначение.Значение;
		КонецЕсли;
		
		ТипЗначенияЭлемента = ТипЗнч(Значение);
		Если ТипЗначенияЭлемента = Тип("Структура") ИЛИ
			 ТипЗначенияЭлемента = Тип("ТаблицаЗначений") ИЛИ
			 ТипЗначенияЭлемента = Тип("ДеревоЗначений") ИЛИ
			 ТипЗначенияЭлемента = Тип("Массив") ИЛИ
			 ТипЗначенияЭлемента = Тип("Соответствие") Тогда
			 
			Если ТипЗначенияЭлемента = Тип("ТаблицаЗначений") Тогда
				// это мутабельное значение его надо хранить в хранилише,
				// на клиенте оно не доступно 
				СтрокаВетки.Значение = "ТаблицаЗначений";
				СтрокаВетки.ХранилищеЗначения = Новый ХранилищеЗначения(Значение);
			ИначеЕсли ТипЗначенияЭлемента = Тип("ДеревоЗначений") Тогда
				// это мутабельное значение его надо хранить в хранилише,
				// на клиенте оно не доступно
				СтрокаВетки.Значение = "ДеревоЗначений";
				СтрокаВетки.ХранилищеЗначения = Новый ХранилищеЗначения(Значение);
			Иначе
				СтрокаВетки.Значение = "[" + Строка(ТипЗначенияЭлемента) + "]";
				ДобавитьКоллекциюВВетку(СтрокаВетки.Строки, Значение);
			КонецЕсли;
		Иначе
			СтрокаВетки.Значение = Значение;
		КонецЕсли;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
КонецПроцедуры // ДобавитьКоллекциюВВетку()

&НаСервере
Процедура СоздатьДеревоЗначенийНаФорме(ПараметрТаблицаЗначений)
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ЭтоПриложение8_5 = ум_ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, "8.5.1.0") > 0;
	
	// создадим реквизит
	МассивРеквизитов = Новый Массив;
	Для Каждого Колонка Из ПараметрТаблицаЗначений.Колонки Цикл
		МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ДеревоЗначений", Колонка.Имя));
	КонецЦикла;
	
	ЭтаФорма.ИзменитьРеквизиты(МассивРеквизитов);
	ДеревоЗначений.ПолучитьЭлементы();
	ЗначениеВРеквизитФормы(ПараметрТаблицаЗначений, "ДеревоЗначений");
	
	// создадим элемент, отображающий данные реквизита
	ЭлементТаблица = ЭтаФорма.Элементы.ДеревоЗначений;
	ЭлементТаблица.Отображение		= ОтображениеТаблицы.Дерево;
	ЭлементТаблица.ТолькоПросмотр 	= Истина;
	ЭлементТаблица.КоманднаяПанель.Видимость = Ложь;
	ЭлементТаблица.КонтекстноеМеню.Видимость = Ложь;
	
	Для Каждого Колонка Из ПараметрТаблицаЗначений.Колонки Цикл 
		Если ЭтоКоллекция И Колонка.Имя = "ХранилищеЗначения" Тогда
			Продолжить;
		КонецЕсли;
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ДеревоЗначений" + Колонка.Имя, Тип("ПолеФормы"), ЭлементТаблица);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Видимость		= Истина;
		НовыйЭлемент.ОграничениеТипа= Колонка.ТипЗначения;
		НовыйЭлемент.ПутьКДанным	= "ДеревоЗначений." + Колонка.Имя;
		Если ЭтоКоллекция И Колонка.Имя = "Ключ" Тогда
			НовыйЭлемент.Ширина = 20;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		КонецЕсли;
		Если ЭтоПриложение8_5 Тогда
			НовыйЭлемент.АвтоШиринаВТаблице = АвтоШиринаВТаблице.ПоДанным;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // СоздатьДеревоЗначенийНаФорме()

&НаСервере
Процедура СоздатьТаблицуЗначенийНаФорме(ПараметрТаблицаЗначений)
	
	// создадим реквизит
	МассивРеквизитов = Новый Массив;
	
	Для Каждого Колонка Из ПараметрТаблицаЗначений.Колонки Цикл
		Если Колонка.ТипЗначения = Новый ОписаниеТипов("МоментВремени") Тогда //недопустимый тип 
			Продолжить;
		КонецЕсли;
	
		МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ТаблицаЗначений", Колонка.Имя));
	КонецЦикла;
	
	ЭтаФорма.ИзменитьРеквизиты(МассивРеквизитов);
	
	ЭтаФорма["ТаблицаЗначений"].Загрузить(ПараметрТаблицаЗначений);
	НужноПронумероватьСтроки = ПараметрТаблицаЗначений.Колонки.Найти("НомерСтроки") = Неопределено;
	НомерСтроки = 1;
	Для Каждого СтрокаДаблицы Из ТаблицаЗначений Цикл
		СтрокаДаблицы.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	// создадим элемент, отображающий данные реквизита
	ЭлементТаблица = ЭтаФорма.Элементы.ТаблицаЗначений;
	ЭлементТаблица.Отображение		= ОтображениеТаблицы.Список;
	ЭлементТаблица.ТолькоПросмотр 	= Истина;
	ЭлементТаблица.КоманднаяПанель.Видимость = Ложь;
	ЭлементТаблица.КонтекстноеМеню.Видимость = Ложь;
	
	Для Каждого Колонка Из ПараметрТаблицаЗначений.Колонки Цикл
	
		Если Колонка.ТипЗначения = Новый ОписаниеТипов("МоментВремени") Тогда //недопустимый тип 
			Продолжить;
		КонецЕсли;
		
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ТаблицаЗначений" + Колонка.Имя, Тип("ПолеФормы"), ЭлементТаблица);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Видимость		= Истина;
		НовыйЭлемент.ОграничениеТипа= Колонка.ТипЗначения;
		НовыйЭлемент.ПутьКДанным	= "ТаблицаЗначений." + Колонка.Имя;
		НовыйЭлемент.Ширина = 20;
		НовыйЭлемент.АвтоШиринаВТаблице = АвтоШиринаВТаблице.Нет;
	КонецЦикла;
	
КонецПроцедуры // СоздатьТаблицуЗначенийНаФорме()

&НаСервере
Функция ПолучитьХранилищеЗначенийНаСервере(ИмяПоля, ИдентификаторСтроки, ИмяТаблицы)
	
	СтрокаТаблицы = ЭтотОбъект[ИмяТаблицы].НайтиПоИдентификатору(ИдентификаторСтроки);
	Значение = СтрокаТаблицы[ИмяПоля];
	
	Возврат Значение;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьЗначениеПоля(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Перем ТекстЗаголовка;
	
	// Если занчение двоичные данные  - предлагать сохранить
	// если Хранилище значения - нужно открыть его в этой же форме новой
	// если массив/структура/дерево/таб док и пр - то что поддерживает наша форма - показать в нашей форме
	// если текст, котрый похож на JSON - показать в окне нижнем????
	// если иное - показать значение
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПоля = Прав(Поле.Имя, СтрДлина(Поле.Имя) - СтрДлина(Элемент.Имя));
	Попытка
		Значение = ТекущиеДанные[ИмяПоля];
	Исключение
		ПоказатьПредупреждение(,"Имя колонки не найдено в таблице значений: " + ИмяПоля);
		Возврат;
	КонецПопытки;
	
	ЗначениеВХранилищеЗначений = Значение = "ТаблицаЗначений" ИЛИ Значение = "ДеревоЗначений";
	Если ЭтоКоллекция И ЗначениеВХранилищеЗначений Тогда
		// Значение было мутабельным и было помещено в хранилище
		ТекстЗаголовка = СформироватьТекстЗаголовка(ТекущиеДанные.Ключ, Значение);
		ИмяПоля  = "ХранилищеЗначения";
		Значение = ТекущиеДанные[ИмяПоля];
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗначения = Тип("ДвоичныеДанные") Тогда
		
		ДополнительныеПараметры = Новый Структура("ДвоичныеДанные", Значение);
		ОписаниеОповещения      = Новый ОписаниеОповещения("СохранитьДвоичныеДанныеПослеЗакрытияВопроса", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения,"Сохранить ""Двоичные данные"" на диск?",РежимДиалогаВопрос.ДаНет);
		
	ИначеЕсли ТипЗначения = Тип("ХранилищеЗначения") ИЛИ ТипЗначения = Тип("ТабличныйДокумент") Тогда
		
		Значение = ПолучитьХранилищеЗначенийНаСервере(ИмяПоля, ТекущиеДанные.ПолучитьИдентификатор(), Элемент.Имя);
		ПараметрыФормы = Новый Структура("Данные", Значение);
		
		Если Не ЗначениеЗаполнено(ТекстЗаголовка) И ЭтоКоллекция Тогда
			ТекстЗаголовка = "Данные " + ?(ТипЗначения = Тип("ТабличныйДокумент"), "табличного документа ", "") + ТекущиеДанные.Ключ;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекстЗаголовка) Тогда
			ПараметрыФормы.Вставить("Заголовок", ТекстЗаголовка);
		КонецЕсли;
		ОткрытьФорму("ОбщаяФорма.ум_ФормаПросмотраДанных",
					 ПараметрыФормы,
					 ЭтаФорма,
					 УникальныйИдентификатор,
					 ,
					 ,
					 ,
					 РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца
		);
		
	ИначеЕсли ТипЗначения <> Тип("Число") И ТипЗначения <> Тип("Дата")
		И ТипЗначения <> Тип("Булево") И ТипЗначения <> Тип("Строка") 
		И ТипЗначения <> Тип("УникальныйИдентификатор") Тогда
		
		ПоказатьЗначение(,Значение);
		
	КонецЕсли;
	
	ОтобразитьЗначениеВТекстаРасшифровкиJSON(Значение);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСообщениеJson(Сообщение)
	
	Результат = "";
	
	Если Не ЗначениеЗаполнено(Сообщение) Тогда
		Возврат Результат;
	КонецЕсли;
	
#Если Не ВебКлиент Тогда
	JSONЧтение = Новый ЧтениеJSON;
	Попытка
		JSONЧтение.УстановитьСтроку(Сообщение);
		СтруктураJson = ПрочитатьJSON(JSONЧтение);
		ЗаписьJSON = Новый ЗаписьJSON();
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтруктураJson);
		Результат = ЗаписьJSON.Закрыть();
	Исключение
		Результат = "";
	КонецПопытки;
#КонецЕсли
	
	Возврат Результат;
	
КонецФункции // ПолучитьСообщениеJson()

&НаКлиенте
Процедура СохранитьДвоичныеДанныеПослеЗакрытияВопроса(Результат, текПараметры) Экспорт
	Если Результат =  КодВозвратаДиалога.Да Тогда
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		Диалог.Заголовок = "Сохранить двоичные данные как ";
		Диалог.МножественныйВыбор = Ложь;
		
		Диалог.Показать(Новый ОписаниеОповещения("СохранитьДвоичныеДанныеПослеЗакрытияВопросаЗавершение", ЭтотОбъект, Новый Структура("Диалог, текПараметры", Диалог, текПараметры)));
		
	КонецЕсли;
КонецПроцедуры // СохранитьДвоичныеДанныеПослеЗакрытияВопроса()

&НаКлиенте
Процедура СохранитьДвоичныеДанныеПослеЗакрытияВопросаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	текПараметры = ДополнительныеПараметры.текПараметры;
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		
		ПутьКФайлу = Диалог.ПолноеИмяФайла;
		ДвоичныеДанные = текПараметры.ДвоичныеДанные;
		Если типЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
			ДвоичныеДанные.Записать(ПутьКФайлу);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // СохранитьДвоичныеДанныеПослеЗакрытияВопросаЗавершение()

&НаСервере
Функция СформироватьТекстЗаголовка(Ключ, Значение)
	Результат = "";
	Если Значение = "ТаблицаЗначений" Тогда
		Результат = "таблицы значений ";
	ИначеЕсли Значение = "ДеревоЗначений" Тогда
		Результат = "дерева значений ";
	КонецЕсли;
	Результат = "Данные " + Результат + Ключ;
	Возврат Результат;
КонецФункции // СформироватьТекстЗаголовка()

&НаКлиенте
Процедура УстановитьВидимостьТекстаРасшифровкиJSON(Видимость)
	ВидимостьТекстаРасшифровкиJSON = Видимость;
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаТаблицаЗначений Тогда
		Элементы.ТаблицаТекстРасшифровкаJSON.Видимость    = ВидимостьТекстаРасшифровкиJSON;
		Если ВидимостьТекстаРасшифровкиJSON Тогда
			Элементы.ТаблицаСкрытьПоказатьПросмотр.ТекущаяСтраница = Элементы.ТаблицаСкрытьПросмотр;
		Иначе
			Элементы.ТаблицаСкрытьПоказатьПросмотр.ТекущаяСтраница = Элементы.ТаблицаПоказатьПросмотр;
		КонецЕсли;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДеревоЗначений Тогда
		Элементы.ДеревоТекстРасшифровкаJSON.Видимость    = ВидимостьТекстаРасшифровкиJSON;
		Если ВидимостьТекстаРасшифровкиJSON Тогда
			Элементы.ДеревоСкрытьПоказатьПросмотр.ТекущаяСтраница = Элементы.ДеревоСкрытьПросмотр;
		Иначе
			Элементы.ДеревоСкрытьПоказатьПросмотр.ТекущаяСтраница = Элементы.ДеревоПоказатьПросмотр;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // УстановитьВидимостьТекстаРасшифровкиJSON()

&НаСервере
Процедура ИнициализацияВидимостиДоступностиЭлемнтовФормы()
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаТаблицаЗначений Тогда
		Элементы.ТаблицаТекстРасшифровкаJSON.Видимость    = ВидимостьТекстаРасшифровкиJSON;
		Если ВидимостьТекстаРасшифровкиJSON Тогда
			Элементы.ТаблицаСкрытьПоказатьПросмотр.ТекущаяСтраница = Элементы.ТаблицаСкрытьПросмотр;
		Иначе
			Элементы.ТаблицаСкрытьПоказатьПросмотр.ТекущаяСтраница = Элементы.ТаблицаПоказатьПросмотр;
		КонецЕсли;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДеревоЗначений Тогда
		Элементы.ДеревоТекстРасшифровкаJSON.Видимость    = ВидимостьТекстаРасшифровкиJSON;
		Если ВидимостьТекстаРасшифровкиJSON Тогда
			Элементы.ДеревоСкрытьПоказатьПросмотр.ТекущаяСтраница = Элементы.ДеревоСкрытьПросмотр;
		Иначе
			Элементы.ДеревоСкрытьПоказатьПросмотр.ТекущаяСтраница = Элементы.ДеревоПоказатьПросмотр;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // ИнициализацияВидимостиДоступностиЭлемнтовФормы()

&НаКлиенте
Процедура ОтобразитьЗначениеВТекстаРасшифровкиJSON(Значение, УстановитьВидимостьТекстаРасшифровкиJSON = Истина)
	
	ТипЗначения= ТипЗнч(Значение);
	Если Не ТипЗначения = Тип("Строка") И Не ТипЗначения = Тип("УникальныйИдентификатор") Тогда
		ТекстРасшифровкаJSON = "";
		Возврат;
	КонецЕсли;
	
	ЭтоJSONСтрока = ТипЗначения = Тип("Строка") И Лев(Значение,1) = "{" И Прав(Значение,1) = "}";
	Если ЭтоJSONСтрока Тогда
		
		СообщениеJson = ПолучитьСообщениеJson(Значение);
		
		Если ЗначениеЗаполнено(СообщениеJson) Тогда
			ТекстРасшифровкаJSON = СообщениеJson;
			Если УстановитьВидимостьТекстаРасшифровкиJSON Тогда
				УстановитьВидимостьТекстаРасшифровкиJSON(Истина);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекстРасшифровкаJSON = Строка(Значение);
		Если УстановитьВидимостьТекстаРасшифровкиJSON Тогда
			УстановитьВидимостьТекстаРасшифровкиJSON(Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеПоляИлиСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Элемент.ТекущийЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПоля = СтрЗаменить(Элемент.ТекущийЭлемент.Имя, Элемент.Имя, "");
	
	Попытка
		Значение = ТекущиеДанные[ИмяПоля];
	Исключение
		ПоказатьПредупреждение(,"Имя колонки не найдено в таблице значений: " + ИмяПоля);
		Возврат;
	КонецПопытки;
	
	ОтобразитьЗначениеВТекстаРасшифровкиJSON(Значение, Ложь);
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции