#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// заполним дерево метаданных
	ЗаполнитьДеревоПоВетвиМетаданных("Справочники");
	ЗаполнитьДеревоПоВетвиМетаданных("Документы");
	ЗаполнитьДеревоПоВетвиМетаданных("ПланыВидовХарактеристик");
	ЗаполнитьДеревоПоВетвиМетаданных("ПланыСчетов");
	ЗаполнитьДеревоПоВетвиМетаданных("ПланыВидовРасчета");
	ЗаполнитьДеревоПоВетвиМетаданных("БизнесПроцессы");
	ЗаполнитьДеревоПоВетвиМетаданных("Задачи");
	ЗаполнитьДеревоПоВетвиМетаданных("РегистрыСведений");
	ЗаполнитьДеревоПоВетвиМетаданных("РегистрыНакопления");
	ЗаполнитьДеревоПоВетвиМетаданных("РегистрыБухгалтерии");
	ЗаполнитьДеревоПоВетвиМетаданных("РегистрыРасчета");
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекСтрока = Элементы.ДеревоМетаданых.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекСтрока.ПолучитьРодителя() = Неопределено Тогда
		// выбрали корень
		Возврат;
	КонецЕсли;
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("ВидМетаданных", ТекСтрока.ПолучитьРодителя().Имя);
	СтруктураРезультат.Вставить("ИмяТипа", ТекСтрока.Имя);
	СтруктураРезультат.Вставить("ПолноеИмя", ТекСтрока.ПолноеИмя);
	
	ЭтаФорма.Закрыть(СтруктураРезультат);
	
КонецПроцедуры // Выбрать()

#КонецОбласти // ОбработчикиКомандФормы

#Область ОбработчикиСобытийТаблицыДеревоМетаданых

&НаКлиенте
Процедура ДеревоМетаданыхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.ДеревоМетаданых.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекСтрока.ПолучитьРодителя() = Неопределено Тогда
		// выбрали корень
		Возврат;
	КонецЕсли;
	
	СтруктураРезультат = Новый Структура("ВидМетаданных, ИмяТипа, ПолноеИмя", ТекСтрока.ПолучитьРодителя().Имя, ТекСтрока.Имя, ТекСтрока.ПолноеИмя);
	
	ЭтаФорма.Закрыть(СтруктураРезультат);
	
КонецПроцедуры // ДеревоМетаданыхВыбор()

#КонецОбласти // ОбработчикиСобытийТаблицыДеревоМетаданых

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДеревоПоВетвиМетаданных(ИмяВетвиМетаданных)
	
	СтрокаВетвиДереваМетаданных = ДеревоМетаданых.ПолучитьЭлементы().Добавить();
	СтрокаВетвиДереваМетаданных.Имя = ИмяВетвиМетаданных;
	СтрокаВетвиДереваМетаданных.Представление = ИмяВетвиМетаданных;
	
	Для каждого ОбъектМетаданных из Метаданные[ИмяВетвиМетаданных] Цикл
		СтрокаОбъектаМетаданных = СтрокаВетвиДереваМетаданных.ПолучитьЭлементы().Добавить();
		СтрокаОбъектаМетаданных.Имя = ОбъектМетаданных.Имя;
		СтрокаОбъектаМетаданных.Представление = ОбъектМетаданных.Синоним;
		СтрокаОбъектаМетаданных.ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьДеревоПоВетвиМетаданных()

#КонецОбласти // СлужебныеПроцедурыИФункции