
&НаКлиенте
Процедура Выбрать(Команда)
	
	ПараметрыОтвета = Новый Структура("ТаймаутДляПрерывания, ИскомаяСтрока, ЛимитВыборки, КоличествоВыводимыхПакетовИзВыборки");
	ПараметрыОтвета.ТаймаутДляПрерывания 		 	    = ТаймаутДляПрерывания;
	ПараметрыОтвета.ИскомаяСтрока					    = ИскомаяСтрока;
	ПараметрыОтвета.ЛимитВыборки					    = ЛимитВыборки;
	ПараметрыОтвета.КоличествоВыводимыхПакетовИзВыборки = КоличествоВыводимыхПакетовИзВыборки;
		
	Закрыть(ПараметрыОтвета);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаймаутДляПрерывания = 120;	
	ЛимитВыборки         = 99999;	
	КоличествоВыводимыхПакетовИзВыборки = 10;

КонецПроцедуры
