#Область ОпределениеПеременных
&НаКлиенте
Перем мУдаляемаяКонстанта;
#КонецОбласти

#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Отказ Тогда
		мУдаляемаяКонстанта = ТекущиеДанные.Константа
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	Если ЗначениеЗаполнено(мУдаляемаяКонстанта) Тогда
		Оповестить("ум_ЗаписьЗначенияКонстанты", мУдаляемаяКонстанта);
		мУдаляемаяКонстанта = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
