#Область УдалениеПакетов

// Удаление данных пакетов по их идентификаторам
// 
// Параметры:
//  МассивИДПакетов - Массив - содержит массив идентификаторов пакетов
//
// Возвращаемое значение:
//   Структура - Ошибка - булево, ОписаниеОшибки - Строка
Функция УдалитьПакетыДанныхИСвязанныеДанные(МассивИдентификаторовПакетов) Экспорт
	Перем МассивИдентификаторовРезультатаОбработки, Ошибка;
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Попытка
		
		// 1. Заблокируем пакеты и журнал пакетов  
		ум_ПакетыДанныхОбщегоНазначения.УстановитьБлокировкуРегистраПакетов("ум_ПакетыДанных", МассивИдентификаторовПакетов);
		ум_ПакетыДанныхОбщегоНазначения.УстановитьБлокировкуРегистраПакетов("ум_ЖурналСобытийПакетовДанных", МассивИдентификаторовПакетов); 
		// Блокировать регистр данных пакета нет смысла, т.к. данные пишутся всегда в одной транзакции с пакетами или связанными записями журнала
		
		// 2. Выберем данные пакетов и журнала
		МассивИдентификаторовРезультатаОбработки = ПолучитьИденитфикаторДанныхИзЖурналаСобытийПакетов(МассивИдентификаторовПакетов);
		
		// 3. Удалим данные и пакеты
		УдалитьДанныеПакетовПоИДНабором("ум_ПакетыДанных", МассивИдентификаторовПакетов);
		УдалитьДанныеПакетовПоИДНабором("ум_ПакетыДанныхДанные", МассивИдентификаторовПакетов);
		УдалитьДанныеПакетовПоИДНабором("ум_ПакетыДанныхДанные", МассивИдентификаторовРезультатаОбработки);
		УдалитьДанныеЖурналСобытийПакетовДанных(МассивИдентификаторовПакетов);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		Возврат Новый Структура("Ошибка, ОписаниеОшибки", Истина, ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Новый Структура("Ошибка, ОписаниеОшибки", Ложь, "");
	
КонецФункции

Функция ПолучитьИденитфикаторДанныхИзЖурналаСобытийПакетов(МассивИдентификаторовПакетов)
	
	МассивИд = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ум_ЖурналСобытийПакетовДанных.ИдентификаторРезультатаОбработки
	|ИЗ
	|	РегистрСведений.ум_ЖурналСобытийПакетовДанных КАК ум_ЖурналСобытийПакетовДанных
	|ГДЕ
	|	ум_ЖурналСобытийПакетовДанных.ИдентификаторПакета В(&МассивИдентификаторовПакетов)
	|	И ум_ЖурналСобытийПакетовДанных.ИдентификаторРезультатаОбработки <> &ПустойУникальныйИдентификатор";
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", ум_ПакетыДанныхОбщегоНазначения.ПустойУникальныйИдентификатор());
	Запрос.УстановитьПараметр("МассивИдентификаторовПакетов", МассивИдентификаторовПакетов);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивИд.Добавить(ВыборкаДетальныеЗаписи.ИдентификаторРезультатаОбработки);
	КонецЦикла;
	
	Возврат МассивИд;
	
КонецФункции

Процедура УдалитьДанныеПакетовПоИДНабором(ИмяРегистраПакета, МассивИдентификаторовПакетов)
	Если МассивИдентификаторовПакетов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НаборУдалить = РегистрыСведений[ИмяРегистраПакета].СоздатьНаборЗаписей();
	
	Для каждого ИДРезультатаОбработки Из МассивИдентификаторовПакетов Цикл
		ЗаписьУдалить = НаборУдалить.Добавить();
		ЗаписьУдалить.ИдентификаторПакета = ИДРезультатаОбработки;
	КонецЦикла;
	
	Если НаборУдалить.Количество() Тогда
		НаборУдалить.Записать(РежимЗамещения.Удаление);
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьДанныеЖурналСобытийПакетовДанных(МассивИдентификаторовПакетов)
	
	Если МассивИдентификаторовПакетов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НаборУдалить = РегистрыСведений.ум_ЖурналСобытийПакетовДанных.СоздатьНаборЗаписей();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ум_ЖурналСобытийПакетовДанных.ИдентификаторПакета КАК ИдентификаторПакета,
		|	ум_ЖурналСобытийПакетовДанных.ВременнаяМеткаСобытия КАК ВременнаяМеткаСобытия
		|ИЗ
		|	РегистрСведений.ум_ЖурналСобытийПакетовДанных КАК ум_ЖурналСобытийПакетовДанных
		|ГДЕ
		|	ум_ЖурналСобытийПакетовДанных.ИдентификаторПакета В(&ИдентификаторПакета)";
	
	Запрос.УстановитьПараметр("ИдентификаторПакета", МассивИдентификаторовПакетов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаписьУдалить = НаборУдалить.Добавить();
		ЗаписьУдалить.ИдентификаторПакета = ВыборкаДетальныеЗаписи.ИдентификаторПакета;
		ЗаписьУдалить.ВременнаяМеткаСобытия = ВыборкаДетальныеЗаписи.ВременнаяМеткаСобытия;
	КонецЦикла;
	
	Если НаборУдалить.Количество() Тогда
		НаборУдалить.Записать(РежимЗамещения.Удаление);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // УдалениеПакетов

#Область РегламентноеУдалениеПакетов

// Обработчик регламентного задания "ум_МногопоточныйКонвейерОбслуживаниеСистемы" (Многопоточный конвейер: обслуживание системы)
Процедура ПакетыДанныхОбслуживание() Экспорт
	Перем ДатаСледующейОбработкиПакета;
	
	ИдентификаторТекущегоФЗ = ум_ЛогированиеПакетыДанных.УникальныйИдентификаторТекущегоФЗ();
	ВидыФЗ = Перечисления.ум_ВидыФЗПакетовДанных.РегламентноеЗаданиеОбслуживаниеСистемы;
	ум_ЛогированиеПакетыДанных.ЗаписатьСтарт(ИдентификаторТекущегоФЗ, ВидыФЗ);
	
	СпособПакетыДанныхОбслуживание = Справочники.ум_СпособыОбработкиПакетов.ПакетыДанныхОбслуживание; 
	Если ум_ПакетыДанныхОбщегоНазначения.ЕстьНеобработанныеПакетыПоСпособуОбработки(СпособПакетыДанныхОбслуживание) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ум_ПакетыДанных.ИдентификаторПакета КАК ИдентификаторПакета
	|ИЗ
	|	(ВЫБРАТЬ
	|		ум_КлючиАналитикиПакетовДанных.Ссылка КАК КлючАналитикиПакетаДанных,
	|		ум_КлючиАналитикиПакетовДанных.СпособОбработкиПакетов.ТаймаутУдаленияПакета КАК ТаймаутУдаленияПакета
	|	ИЗ
	|		Справочник.ум_КлючиАналитикиПакетовДанных КАК ум_КлючиАналитикиПакетовДанных
	|	ГДЕ
	|		ум_КлючиАналитикиПакетовДанных.СпособОбработкиПакетов.УдалятьПакетПриУспешнойОбработке
	|		И ум_КлючиАналитикиПакетовДанных.СостояниеПакетаДанных = ЗНАЧЕНИЕ(Перечисление.ум_СостоянияПакетаДанных.Обработан)) КАК КлючиАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ум_ПакетыДанных КАК ум_ПакетыДанных
	|		ПО (ум_ПакетыДанных.КлючАналитикиПакетаДанных = КлючиАналитики.КлючАналитикиПакетаДанных)
	|ГДЕ
	|	НЕ ум_ПакетыДанных.ПакетПрипаркован
	|	И ДОБАВИТЬКДАТЕ(ум_ПакетыДанных.ДатаОбработкиПакета, ЧАС, КлючиАналитики.ТаймаутУдаленияПакета) <= &ДатаСеанса";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("ДатаСеанса", ТекущаяДатаСеанса());
	ТаблицаЗаданий  = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаЗаданий.Количество() > 0 Тогда
	
		РазмерНарезки = 1000;
		МассивТаблицПакетов = ум_ОбщегоНазначенияКлиентСервер.РазбитьТаблицу(ТаблицаЗаданий, РазмерНарезки);
		
		Для каждого ТаблицаПакета Из МассивТаблицПакетов Цикл 
			МассивИДПакетовНаУдаление = ТаблицаПакета.ВыгрузитьКолонку("ИдентификаторПакета");
			КоличествоПакетов = ТаблицаПакета.Количество(); 
			
			ум_ПакетыДанных.СоздатьПакетДанных(МассивИДПакетовНаУдаление,
												СпособПакетыДанныхОбслуживание,
												ДатаСледующейОбработкиПакета,
												"Удаление обработанных пакетов по таймауту",
												"Количество пакетов: " + КоличествоПакетов
			);
		КонецЦикла;
		
	КонецЕсли;
	
	ДанныеСобытия = Новый Структура("Комментарий", "Созадано задание на удаление" + ТаблицаЗаданий.Количество() + " пакетов.");
	ум_ЛогированиеПакетыДанных.ЗаписатьОкончание(ИдентификаторТекущегоФЗ, ВидыФЗ,,,ДанныеСобытия);
	
	СоздатьПакетНаОчисткуЛоговФЗ();
КонецПроцедуры // ПакетыДанныхОбслуживание()

//////////////////////////////////////////////////////////////////////////
// Функция способа обработки пакетов "Регламентное обслуживание пакетов даных". Удаление выполненных пакетов 
//
// Параметры:
//		МассивИДПакетов - Массив - содержит массив идентификаторов пакетов
//		ПараметрыПакетаДанных - Структура - необязательный параметр. Параметры Пакета Данных
//		ПараметрыСпособаОбработки - Структура - необязательный параметр. Параметры способа обработки пакетов
//
// Возвращаемое значение:
//		Структура - СостояниеПакетаДанных (Перечисления.ум_СостоянияПакетаДанных) , Сообщение - Строка - время обработки
Функция ПакетыДанныхОбслуживание_ОбработкаПакета(МассивИДПакетов,
												 ПараметрыПакетаДанных = Неопределено,
												 ПараметрыСпособаОбработки = Неопределено) Экспорт
	
	Результат = УдалитьПакетыДанныхИСвязанныеДанные(МассивИДПакетов);
	
	Если Результат.Ошибка Тогда
		ВызватьИсключение Результат.ОписаниеОшибки;
	Иначе
		Возврат Новый Структура("СостояниеПакетаДанных, Сообщение", Перечисления.ум_СостоянияПакетаДанных.Обработан, "");
	КонецЕсли;
	
КонецФункции


Процедура СоздатьПакетНаОчисткуЛоговФЗ()
	ПараметрыУдаленияЛоговФЗ = ум_ПакетыДанныхПовтИсп.ПолучитьНастройкиЛогированияФЗ(); 
	
	МеткаВремениОчистки = ТекущаяУниверсальнаяДатаВМиллисекундах() - ПараметрыУдаленияЛоговФЗ.ТаймаутУдаленияЛоговФЗ * 3600 * 1000;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК Поле1
		|ИЗ
		|	РегистрСведений.ум_ЛогФоновыхЗаданийПакетов КАК ум_ЛогФоновыхЗаданийПакетов
		|ГДЕ
		|	ум_ЛогФоновыхЗаданийПакетов.ВременнаяМеткаСобытия < &ВременнаяМеткаСобытия";
	
	Запрос.УстановитьПараметр("ВременнаяМеткаСобытия", МеткаВремениОчистки);
	
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат; // Нет данных для очистки, создавать пакет не нужно
	КонецЕсли;
	
	ЗапросСпособа = Новый Запрос;
	ЗапросСпособа.Текст =
		"ВЫБРАТЬ
		|	ум_СпособыОбработкиПакетов.Ссылка КАК Ссылка,
		|	ум_СпособыОбработкиПакетов.ИмяФункции КАК ИмяФункции
		|ИЗ
		|	Справочник.ум_СпособыОбработкиПакетов КАК ум_СпособыОбработкиПакетов
		|ГДЕ
		|	ум_СпособыОбработкиПакетов.ИмяПредопределенныхДанных = &ИмяПредопределенныхДанных";
	
	ЗапросСпособа.УстановитьПараметр("ИмяПредопределенныхДанных", "ОчисткаЛоговФЗ");
	ВыборкаСпособа = ЗапросСпособа.Выполнить().Выбрать();
	
	Если Не ВыборкаСпособа.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	СпособОбработки = ВыборкаСпособа.Ссылка;
	
	Если Не ЗначениеЗаполнено(ВыборкаСпособа.ИмяФункции) Тогда
		СпособОбработкиОбъект = СпособОбработки.ПолучитьОбъект();
		СпособОбработкиОбъект.ИмяФункции = "ум_ЛогированиеПакетыДанных.СпособОбработкиОчисткаЛоговФЗ";
		СпособОбработкиОбъект.Записать();											
	КонецЕсли; 
	
	ДатаОчистки = ТекущаяДатаСеанса() - ПараметрыУдаленияЛоговФЗ.ТаймаутУдаленияЛоговФЗ * 3600;
	ПараметрыОчистки = Новый Структура("ДатаУдаления", ДатаОчистки);
	
	ум_ПакетыДанных.СоздатьПакетДанных(
		ПараметрыОчистки,
		СпособОбработки,
		Неопределено,
		"Удаление логов ФЗ на " + ДатаОчистки,
		""
	);

КонецПроцедуры

#КонецОбласти // РегламентноеУдалениеПакетов
