// Функция - Создание пакета данных.
//
// Параметры:
//  Данные						 - число - Произвольные данные
//  СпособОбработки				 - ИмяДляразработчика, наименование элемента, ссылка на элемент справочника ум_СпособыОбработкиПакетов
//  ДатаСледующейОбработкиПакета - Дата - Дата, после которой система будет пытаться обработать пакет данных
//  ДополнительнаяИнформация	 - Строка - Дополнительная информация о пакете данных
//  Комментарий					 - Строка - Произвольный комментарий к пакету данных
// 
// Возвращаемое значение:
//  Структура, содержащая поля: ИдентификаторПакета, Ошибка, ОписаниеОшибки 
Функция СоздатьПакетДанных(Данные, СпособОбработки, ДатаСледующейОбработкиПакета, ДополнительнаяИнформация = "", Комментарий = "") Экспорт
	
	Результат = Новый Структура("ИдентификаторПакета, Ошибка, ОписаниеОшибки");
	
	Результат.Ошибка = Ложь;
	
	ИдентификаторПакета = Новый УникальныйИдентификатор;
	
	НаборЗаписейПакетыДанных = РегистрыСведений.ум_ПакетыДанных.СоздатьНаборЗаписей();
	ПакетДанных = НаборЗаписейПакетыДанных.Добавить();
	
	Если ТипЗнч(СпособОбработки) = Тип("СправочникСсылка.ум_СпособыОбработкиПакетов") Тогда
		ТекСпособОбработки = СпособОбработки;
	ИначеЕсли ТипЗнч(СпособОбработки) = Тип("Строка") Тогда
		ИмяДляРазработчика = СокрЛП(СпособОбработки);
		ТекСпособОбработки = Справочники.ум_СпособыОбработкиПакетов.НайтиПоРеквизиту("ИмяДляРазработчика", ИмяДляРазработчика);
		Если НЕ ЗначениеЗаполнено(ТекСпособОбработки) Тогда
			Результат.Ошибка		 = Истина;
			Результат.ОписаниеОшибки = "Неожиданное имя для разработчика способа обработки пакета """ + ИмяДляРазработчика + """! Пакет не создан.";
			Возврат Результат;
		КонецЕсли;
	Иначе
		Результат.Ошибка			= Истина;
		Результат.ОписаниеОшибки	= "Неожиданное тип значения параметра ""СпособОбработки"": " + ТипЗнч(СпособОбработки) + "! Пакет не создан.";
		Возврат Результат;
	КонецЕсли;
	
	// создадим пакет данных
	ПакетДанных.ИдентификаторПакета		= ИдентификаторПакета; 
	ПакетДанных.ВременнаяМеткаСоздания	= ТекущаяУниверсальнаяДатаВМиллисекундах();
	ПакетДанных.ДатаСозданияПакета		= ТекущаяДатаСеанса();
	
	ПакетДанных.КлючАналитикиПакетаДанных = ум_ПакетыДанныхПовтИсп.ПолучитьКлючАналитикиПакетаДанных(ТекСпособОбработки, Перечисления.ум_СостоянияПакетаДанных.КОбработке);
	Если НЕ ЗначениеЗаполнено(ПакетДанных.КлючАналитикиПакетаДанных) Тогда
		Результат.Ошибка			= Истина;
		Результат.ОписаниеОшибки	= "Не найден ключ аналитики пакета данных! Способ обработки: "+ПакетДанных.СпособОбработки+". Состояние: "+Перечисления.ум_СостоянияПакетаДанных.КОбработке+".";
		Возврат Результат;
	КонецЕсли;
	
	ПакетДанных.ДатаСледующейОбработкиПакета= ДатаСледующейОбработкиПакета;
	ПакетДанных.КоличествоПопытокОбработки	= 0;
	
	ПакетДанных.ДополнительнаяИнформация	= ДополнительнаяИнформация;
	ПакетДанных.Комментарий					= Комментарий;
	
	// создадим данные пакета данных
	НаборЗаписейДанные = РегистрыСведений.ум_ПакетыДанныхДанные.СоздатьНаборЗаписей();
	ДанныеПакета = НаборЗаписейДанные.Добавить();
	
	ДанныеПакета.ИдентификаторПакета	= ИдентификаторПакета;
	ДанныеПакета.Данные 				= Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(1));
	
	Результат.ИдентификаторПакета	= ПакетДанных.ИдентификаторПакета;
	Результат.Вставить("ДатаСозданияПакета", ПакетДанных.ДатаСозданияПакета);
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	Попытка
		НаборЗаписейПакетыДанных.Записать(Ложь); // нет смысла замещать набор записей, т.к. это гарантированно новая запись по новому УИД 
		НаборЗаписейДанные.Записать(Ложь);
	Исключение
		ОтменитьТранзакцию();
		Результат.Ошибка = Истина;
		Результат.ОписаниеОшибки = "Ошибка записи пакета! "+ОписаниеОшибки();
		Возврат Результат;
	КонецПопытки;
	ЗафиксироватьТранзакцию();
	
	Возврат Результат;
	
КонецФункции

// Процедура - Запуск обарботки пакета по идентификатору в сеансе пользователя
//
// Параметры:
//  ИдентификаторПакета			 - УникальныйИдентификатор - Уникальный идентификатор пакета данных
//
Процедура ОбработатьПакетДанныхВСеансеПользователя(ИдентификаторПакета) Экспорт
	
	ЗначенияРеквизитовПакета = ум_ПакетыДанныхОбработка.ЗначенияРеквизитовПакетаДанных(ИдентификаторПакета);
	
	Если Не ЗначениеЗаполнено(ЗначенияРеквизитовПакета.СпособОбработкиПакетов) Тогда 
		ВызватьИсключение "Не заполнен способ обработки пакета с идентификатором " + ИдентификаторПакета;
	КонецЕсли;
	
	ПараметрыСпособаОбработки = ум_ПакетыДанныхОбщегоНазначения.ПолучитьПараметрыСпособаОбработки(ЗначенияРеквизитовПакета.СпособОбработкиПакетов);
	ПараметрыСпособаОбработки.Вставить("ОбработкаПакетаВСеансеКлиента", Истина);
	
	МассивИдентификаторов = Новый Массив;
	МассивИдентификаторов.Добавить(ИдентификаторПакета);
	
	ум_ПакетыДанныхОбработка.ОбработчикРабочегоФЗ(МассивИдентификаторов, ПараметрыСпособаОбработки);
	
КонецПроцедуры